{
  "last_updated": "2025-08-16T08:48:23Z",
  "count": 40,
  "items": [
    {
      "title": "Fortinet FortiSIEM Command Injection Vulnerability (CVE-2025-25256) – Technical Details Revealed",
      "link": "https://cybersecuritynews.com/fortinet-fortisiem-command-injection-vulnerability/",
      "date": "2025-08-16T07:55:40Z",
      "description": "Cybersecurity researchers from watchTowr Labs have published a comprehensive technical analysis of a critical pre-authentication command injection vulnerability affecting Fortinet FortiSIEM systems, designated as CVE-2025-25256. The vulnerability carries a maximum CVSS score of 9.8 and has already been exploited in the wild, making it one of the most pressing security threats facing enterprise…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Russian Group EncryptHub Exploits MSC EvilTwin Vulnerability to Deploy Fickle Stealer Malware",
      "link": "https://thehackernews.com/2025/08/russian-group-encrypthub-exploits-msc.html",
      "date": "2025-08-16T05:34:00Z",
      "description": "The threat actor known as EncryptHub is continuing to exploit a now-patched security flaw impacting Microsoft Windows to deliver malicious payloads. Trustwave SpiderLabs said it recently observed an EncryptHub campaign that brings together social engineering and the exploitation of a vulnerability in the Microsoft Management Console (MMC) framework (CVE-2025-26633, aka MSC EvilTwin) to trigger",
      "source": "thehackernews.com"
    },
    {
      "title": "Palo Alto Networks Released A Mega Malware Analysis Tutorials Useful for Every Malware Analyst",
      "link": "https://cybersecuritynews.com/palo-alto-networks-released-a-mega-malware-analysis-tutorials/",
      "date": "2025-08-15T21:18:44Z",
      "description": "Palo Alto Networks has published an extensive malware analysis tutorial detailing the dissection of a sophisticated .NET-based threat that delivers the Remcos remote access trojan (RAT). The malware’s emergence highlights a trend in which threat actors increasingly abuse legitimate development environments and tools—such as the Microsoft .NET runtime—to execute complex, multi-stage infection…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Ransomware Actors Blending Legitimate Tools with Custom Malware to Evade Detection",
      "link": "https://cybersecuritynews.com/ransomware-actors-blending-legitimate-tools/",
      "date": "2025-08-15T20:42:05Z",
      "description": "The cybersecurity landscape faces a new sophisticated threat as the Crypto24 ransomware group demonstrates an alarming evolution in attack methodology, seamlessly blending legitimate administrative tools with custom-developed malware to execute precision strikes against high-value targets. This emerging ransomware operation has successfully compromised organizations across Asia, Europe, and the…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Google Requires Crypto App Developers to Have License or Certification From Relevant Authorities",
      "link": "https://cybersecuritynews.com/google-requires-crypto-app-developers-to-have-license/",
      "date": "2025-08-15T20:17:25Z",
      "description": "Google Play has implemented comprehensive licensing requirements for cryptocurrency exchanges and software wallets, fundamentally reshaping the mobile app ecosystem for digital asset services. The policy mandates that developers seeking to publish cryptocurrency applications must obtain specific licenses and certifications from relevant financial authorities in their target jurisdictions before…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Threat Actors Using CrossC2 Tool to Expand Cobalt Strike to Operate on Linux and macOS",
      "link": "https://cybersecuritynews.com/threat-actors-using-crossc2-tool/",
      "date": "2025-08-15T19:22:29Z",
      "description": "A sophisticated threat campaign has emerged that leverages CrossC2, an unofficial extension tool that expands Cobalt Strike’s notorious capabilities beyond Windows systems to target Linux and macOS environments. Between September and December 2024, cybersecurity incidents involving this cross-platform malware have been documented, representing a significant evolution in threat actor tactics that…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "RealDefense Opens $10M Fund to Help OEMs Monetize Installs With SmartScan Cybersecurity SDK",
      "link": "https://www.darkreading.com/endpoint-security/realdefense-opens-10m-fund-smartscan-cybersecurity-sdk",
      "date": "2025-08-15T18:59:09Z",
      "description": "",
      "source": "darkreading.com"
    },
    {
      "title": "New Crypto24 Ransomware Attacks Bypass EDR",
      "link": "https://www.darkreading.com/cybersecurity-operations/crypto24-ransomware-bypass-edr",
      "date": "2025-08-15T18:49:02Z",
      "description": "While several cybercrime groups have embraced \"EDR killers,\" researchers say the deep knowledge and technical skills demonstrated by Crypto24 signify a dangerous escalation.",
      "source": "darkreading.com"
    },
    {
      "title": "Colt Telecommunications Struggles in Wake of Cyber Incident",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/colt-telecommunications-cyber-incident",
      "date": "2025-08-15T18:12:37Z",
      "description": "The UK telco said it temporarily took some systems offline as a \"protective\" measure in its investigation.",
      "source": "darkreading.com"
    },
    {
      "title": "Taiwan Web Servers Breached by UAT-7237 Using Customized Open-Source Hacking Tools",
      "link": "https://thehackernews.com/2025/08/taiwan-web-servers-breached-by-uat-7237.html",
      "date": "2025-08-15T16:20:00Z",
      "description": "A Chinese-speaking advanced persistent threat (APT) actor has been observed targeting web infrastructure entities in Taiwan using customized versions of open-sourced tools with an aim to establish long-term access within high-value victim environments. The activity has been attributed by Cisco Talos to an activity cluster it tracks as UAT-7237, which is believed to be active since at least 2022.",
      "source": "thehackernews.com"
    },
    {
      "title": "Colt Telecom attack claimed by WarLock ransomware, data up for sale",
      "link": "https://www.bleepingcomputer.com/news/security/colt-telecom-attack-claimed-by-warlock-ransomware-data-up-for-sale/",
      "date": "2025-08-15T15:25:34Z",
      "description": "UK-based telecommunications company Colt Technology Services is dealing with a cyberattack that has caused a multi-day outage of some of the company's operations, including hosting and porting services, Colt Online and Voice API platforms. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Cisco warns of max severity flaw in Firewall Management Center",
      "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-max-severity-flaw-in-firewall-management-center/",
      "date": "2025-08-15T13:57:45Z",
      "description": "Cisco is warning about a critical remote code execution (RCE) vulnerability in the RADIUS subsystem of its Secure Firewall Management Center (FMC) software. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Using Security Expertise to Bridge the Communication Gap",
      "link": "https://www.darkreading.com/cybersecurity-operations/using-security-expertise-bridge-communication-gap",
      "date": "2025-08-15T13:30:00Z",
      "description": "Cybersecurity-focused leadership delivers better products and business outcomes.",
      "source": "darkreading.com"
    },
    {
      "title": "Microsoft reminds of Windows 10 support ending in two months",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-reminds-users-of-windows-10-retirement-in-october/",
      "date": "2025-08-15T13:09:18Z",
      "description": "Microsoft has reminded customers that Windows 10 will be retired in two months after all editions of Windows 10, version 22H2 reach their end of servicing on October 14. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Water Systems Under Attack: Norway, Poland Blame Russia Actors",
      "link": "https://www.darkreading.com/ics-ot-security/water-systems-attack-norway-poland-russia-actors",
      "date": "2025-08-15T13:00:00Z",
      "description": "Water and wastewater systems have become a favored target of nation-state actors, drawing increasing scrutiny following attacks on systems in multiple countries.",
      "source": "darkreading.com"
    },
    {
      "title": "In Other News: Critical Zoom Flaw, City’s Water Threatened by Hack, $330 Billion OT Cyber Risk",
      "link": "https://www.securityweek.com/in-other-news-critical-zoom-flaw-citys-water-threatened-by-hack-330-billion-ot-cyber-risk/",
      "date": "2025-08-15T12:32:09Z",
      "description": "Other noteworthy stories that might have slipped under the radar: Canada’s House of Commons hacked, Russia behind court system attack, Pennsylvania AG targeted in cyberattack. The post In Other News: Critical Zoom Flaw, City’s Water Threatened by Hack, $330 Billion OT Cyber Risk appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Plex warns users to patch security vulnerability immediately",
      "link": "https://www.bleepingcomputer.com/news/security/plex-warns-users-to-patch-security-vulnerability-immediately/",
      "date": "2025-08-15T11:41:16Z",
      "description": "Plex has notified some of its users on Thursday to urgently update their media servers due to a recently patched security vulnerability. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "U.S. Sanctions Garantex and Grinex Over $100M in Ransomware-Linked Illicit Crypto Transactions",
      "link": "https://thehackernews.com/2025/08/us-sanctions-garantex-and-grinex-over.html",
      "date": "2025-08-15T11:27:00Z",
      "description": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Thursday renewed sanctions against Russian cryptocurrency exchange platform Garantex for facilitating ransomware actors and other cybercriminals by processing more than $100 million in transactions linked to illicit activities since 2019. The Treasury said it's also imposing sanctions on Garantex's successor, Grinex",
      "source": "thehackernews.com"
    },
    {
      "title": "Zero Trust + AI: Privacy in the Age of Agentic AI",
      "link": "https://thehackernews.com/2025/08/zero-trust-ai-privacy-in-age-of-agentic.html",
      "date": "2025-08-15T11:00:00Z",
      "description": "We used to think of privacy as a perimeter problem: about walls and locks, permissions, and policies. But in a world where artificial agents are becoming autonomous actors — interacting with data, systems, and humans without constant oversight — privacy is no longer about control. It’s about trust. And trust, by definition, is about what happens when you’re not looking. Agentic AI — AI that",
      "source": "thehackernews.com"
    },
    {
      "title": "Tight Cybersecurity Budgets Accelerate the Shift to AI-Driven Defense",
      "link": "https://www.securityweek.com/tight-cybersecurity-budgets-accelerate-the-shift-to-ai-driven-defense/",
      "date": "2025-08-15T09:57:56Z",
      "description": "With cybersecurity budgets strained, organizations are turning to AI-powered automation to plug staffing gaps, maintain defenses, and survive escalating threats. The post Tight Cybersecurity Budgets Accelerate the Shift to AI-Driven Defense appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Google Says Android pKVM Earns Highest Level of Security Assurance",
      "link": "https://www.securityweek.com/google-says-android-pkvm-earns-highest-level-of-security-assurance/",
      "date": "2025-08-15T09:44:57Z",
      "description": "Android pKVM has achieved SESIP Level 5 certification, which means it’s resistant to highly skilled, motivated, and funded attackers. The post Google Says Android pKVM Earns Highest Level of Security Assurance appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "US sanctions Grinex crypto-exchange, successor to Garantex",
      "link": "https://www.bleepingcomputer.com/news/security/us-sanctions-grinex-crypto-exchange-garantexs-successor/",
      "date": "2025-08-15T08:46:59Z",
      "description": "The U.S. Department of the Treasury has announced sanctions against Grinex, the successor to Russian cryptocurrency exchange Garantex, which was previously sanctioned for helping ransomware gangs launder their money. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Critical Flaws Patched in Rockwell FactoryTalk, Micro800, ControlLogix Products",
      "link": "https://www.securityweek.com/critical-flaws-patched-in-rockwell-factorytalk-micro800-controllogix-products/",
      "date": "2025-08-15T08:33:50Z",
      "description": "Rockwell Automation has published several advisories describing critical and high-severity vulnerabilities affecting its products. The post Critical Flaws Patched in Rockwell FactoryTalk, Micro800, ControlLogix Products appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Cisco Patches Critical Vulnerability in Firewall Management Platform",
      "link": "https://www.securityweek.com/cisco-patches-critical-vulnerability-in-firewall-management-platform/",
      "date": "2025-08-15T07:45:30Z",
      "description": "Cisco has released over 20 advisories as part of its August 2025 bundled publication for ASA, FMC and FTD products. The post Cisco Patches Critical Vulnerability in Firewall Management Platform appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Cisco Warns of CVSS 10.0 FMC RADIUS Flaw Allowing Remote Code Execution",
      "link": "https://thehackernews.com/2025/08/cisco-warns-of-cvss-100-fmc-radius-flaw.html",
      "date": "2025-08-15T06:49:00Z",
      "description": "Cisco has released security updates to address a maximum-severity security flaw in Secure Firewall Management Center (FMC) Software that could allow an attacker to execute arbitrary code on affected systems. The vulnerability, assigned the CVE identifier CVE-2025-20265 (CVSS score: 10.0), affects the RADIUS subsystem implementation that could permit an unauthenticated, remote attacker to inject",
      "source": "thehackernews.com"
    },
    {
      "title": "ZDI-CAN-27786: Katana Network",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 9.8 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Peter Girnus (@gothburz) of Trend Research' was reported to the affected vendor on: 2025-08-14, 2 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-22274: Hexo",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 3.7 AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N severity vulnerability discovered by 'Grigory Dorodnov of Trend Micro Security Research' was reported to the affected vendor on: 2025-08-14, 2 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-27784: github-kanban-mcp-server",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 9.8 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Brandon Niemczyk & Peter Girnus (@gothburz) of Trend Zero Day Initiative' was reported to the affected vendor on: 2025-08-14, 2 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-26620: Hancom",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 7.8 AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H severity vulnerability discovered by 'rgod' was reported to the affected vendor on: 2025-08-14, 2 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-27894: Apple",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 7.8 AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Nikolai Skliarenko of Trend Micro Security Research' was reported to the affected vendor on: 2025-08-14, 2 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "New Zero-Click Flaw Bypasses Microsoft’s Patch, Leaking NTLM Credentials, PoC Available",
      "link": "https://securityonline.info/new-zero-click-flaw-bypasses-microsofts-patch-leaking-ntlm-credentials-poc-available/",
      "date": "2025-08-13T11:14:18Z",
      "description": "The post New Zero-Click Flaw Bypasses Microsoft’s Patch, Leaking NTLM Credentials, PoC Available appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical macOS Flaw (CVSS 9.8) Bypasses TCC Without Root Access: PoC Published",
      "link": "https://securityonline.info/critical-macos-flaw-cvss-9-8-bypasses-tcc-without-root-access-poc-published/",
      "date": "2025-08-11T10:31:51Z",
      "description": "The post Critical macOS Flaw (CVSS 9.8) Bypasses TCC Without Root Access: PoC Published appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Flaw (CVSS 9.8) in Ubiquiti UniFi Connect EV Stations Allows Remote Code Execution",
      "link": "https://securityonline.info/critical-flaw-cvss-9-8-in-ubiquiti-unifi-connect-ev-stations-allows-remote-code-execution/",
      "date": "2025-08-07T03:45:59Z",
      "description": "The post Critical Flaw (CVSS 9.8) in Ubiquiti UniFi Connect EV Stations Allows Remote Code Execution appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "VirtualBox VM Escape: Integer Overflow Flaw Allows Full Host Takeover, PoC Published",
      "link": "https://securityonline.info/virtualbox-vm-escape-integer-overflow-flaw-allows-full-host-takeover-poc-published/",
      "date": "2025-08-06T10:14:36Z",
      "description": "The post VirtualBox VM Escape: Integer Overflow Flaw Allows Full Host Takeover, PoC Published appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Dell DD OS Flaw (CVSS 9.8) Allows Unauthenticated Remote Access",
      "link": "https://securityonline.info/critical-dell-dd-os-flaw-cvss-9-8-allows-unauthenticated-remote-access/",
      "date": "2025-08-05T00:16:34Z",
      "description": "The post Critical Dell DD OS Flaw (CVSS 9.8) Allows Unauthenticated Remote Access appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "date": "2022-08-31T12:57:48Z",
      "description": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "source": "threatpost.com"
    },
    {
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "date": "2022-08-30T16:00:43Z",
      "description": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "source": "threatpost.com"
    },
    {
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "date": "2022-08-29T14:56:19Z",
      "description": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "source": "threatpost.com"
    },
    {
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "date": "2022-08-26T16:44:27Z",
      "description": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "source": "threatpost.com"
    },
    {
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "date": "2022-08-25T18:47:15Z",
      "description": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "source": "threatpost.com"
    }
  ]
}