{
  "last_updated": "2025-08-13T10:48:37Z",
  "count": 30,
  "items": [
    {
      "title": "Windows Remote Desktop Services Vulnerability Let Attacker Deny Services Over Network",
      "link": "https://cybersecuritynews.com/windows-remote-desktop-services-vulnerability-deny/",
      "date": "2025-08-13T09:56:52Z",
      "description": "Microsoft released security patches addressing a significant vulnerability in Windows Remote Desktop Services that could allow unauthorized attackers to launch denial of service attacks over network connections. The vulnerability, designated as CVE-2025-53722, affects multiple Windows versions spanning from legacy systems to the latest Windows Server 2025 and Windows 11 24H2 releases. Key…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Webinar: What the Next Wave of AI Cyberattacks Will Look Like — And How to Survive",
      "link": "https://thehackernews.com/2025/08/webinar-what-next-wave-of-ai.html",
      "date": "2025-08-13T09:30:00Z",
      "description": "The AI revolution isn’t coming. It’s already here. From copilots that write our emails to autonomous agents that can take action without us lifting a finger, AI is transforming how we work. But here’s the uncomfortable truth: Attackers are evolving just as fast. Every leap forward in AI gives bad actors new tools — deepfake scams so real they trick your CFO, bots that can bypass human review,",
      "source": "thehackernews.com"
    },
    {
      "title": "Fortinet, Ivanti Release August 2025 Security Patches",
      "link": "https://www.securityweek.com/fortinet-ivanti-release-august-2025-security-patches/",
      "date": "2025-08-13T09:19:01Z",
      "description": "Fortinet and Ivanti have published new security advisories for their August 2025 Patch Tuesday updates. The post Fortinet, Ivanti Release August 2025 Security Patches appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Ukrainian Web3team Weaponizing NPM Package to Attack Job Seekers and Steal Sensitive Data",
      "link": "https://cybersecuritynews.com/ukrainian-web3team-weaponizing-npm-package/",
      "date": "2025-08-13T09:12:39Z",
      "description": "A sophisticated cybercriminal operation disguised as a Ukrainian Web3 development team has been targeting job seekers through weaponized NPM packages, security researchers warn. The attack leverages fake interview processes to trick unsuspecting candidates into downloading and executing malicious code that steals cryptocurrency wallets, browser data, and sensitive personal information. The…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "What is MCP Server – How it is Powering AI-Driven Cyber Defense",
      "link": "https://cybersecuritynews.com/mcp-server/",
      "date": "2025-08-13T09:07:21Z",
      "description": "MCP (Model Control Plane) Server is a centralized platform that orchestrates, manages, and secures the lifecycle of AI models deployed across an organization’s infrastructure. By providing integration, management, and real-time monitoring of models, MCP servers enable enterprises to defend against sophisticated, AI-powered cyberattacks. This article explores MCP server integration and usage, its…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "New Windows 0-Click NTLM Credential Leakage Vulnerability Bypasses Microsoft’s Patch",
      "link": "https://cybersecuritynews.com/windows-0-click-ntlm-credential-leakage/",
      "date": "2025-08-13T08:54:10Z",
      "description": "A critical zero-click NTLM credential leakage vulnerability that circumvents Microsoft’s recent patch for CVE-2025-24054. The newly identified flaw, assigned CVE-2025-50154, allows attackers to extract NTLM hashes from fully patched Windows systems without any user interaction, demonstrating that Microsoft’s April security update was incomplete. Key Takeaways1. CVE-2025-50154 bypasses…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Microsoft August 2025 Patch Tuesday Fixes Kerberos Zero-Day Among 111 Total New Flaws",
      "link": "https://thehackernews.com/2025/08/microsoft-august-2025-patch-tuesday.html",
      "date": "2025-08-13T08:47:00Z",
      "description": "Microsoft on Tuesday rolled out fixes for a massive set of 111 security flaws across its software portfolio, including one flaw that has been disclosed as publicly known at the time of the release. Of the 111 vulnerabilities, 16 are rated Critical, 92 are rated Important, two are rated Moderate, and one is rated Low in severity. Forty-four of the vulnerabilities relate to privilege",
      "source": "thehackernews.com"
    },
    {
      "title": "FortiOS, FortiProxy, and FortiPAM Auth Bypass Vulnerability Allows Attackers to Gain Full Control",
      "link": "https://cybersecuritynews.com/fortinet-authentication-bypass/",
      "date": "2025-08-13T08:41:37Z",
      "description": "A high-severity authentication bypass vulnerability affecting multiple Fortinet security products, including FortiOS, FortiProxy, and FortiPAM systems. The flaw, designated as CVE-2024-26009 with a CVSS score of 7.9, enables unauthenticated attackers to seize complete control of managed devices through exploitation of the FortiGate-to-FortiManager (FGFM) communication protocol. Key Takeaways1.…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "ICS Patch Tuesday: Major Vendors Address Code Execution Vulnerabilities",
      "link": "https://www.securityweek.com/ics-patch-tuesday-major-vendors-address-code-execution-vulnerabilities/",
      "date": "2025-08-13T06:36:25Z",
      "description": "August 2025 ICS Patch Tuesday advisories have been published by Siemens, Schneider, Aveva, Honeywell, ABB and Phoenix Contact. The post ICS Patch Tuesday: Major Vendors Address Code Execution Vulnerabilities appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Charon Ransomware Hits Middle East Sectors Using APT-Level Evasion Tactics",
      "link": "https://thehackernews.com/2025/08/charon-ransomware-hits-middle-east.html",
      "date": "2025-08-13T05:45:00Z",
      "description": "Cybersecurity researchers have discovered a new campaign that employs a previously undocumented ransomware family called Charon to target the Middle East's public sector and aviation industry. The threat actor behind the activity, according to Trend Micro, exhibited tactics mirroring those of advanced persistent threat (APT) groups, such as DLL side-loading, process injection, and the ability",
      "source": "thehackernews.com"
    },
    {
      "title": "Adobe Patches Over 60 Vulnerabilities Across 13 Products",
      "link": "https://www.securityweek.com/adobe-patches-over-60-vulnerabilities-across-13-products/",
      "date": "2025-08-13T04:36:10Z",
      "description": "Adobe’s security updates fix vulnerabilities in Commerce, Substance, InDesign, FrameMaker, Dimension and other products. The post Adobe Patches Over 60 Vulnerabilities Across 13 Products appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Microsoft Patches Over 100 Vulnerabilities",
      "link": "https://www.securityweek.com/microsoft-patches-over-100-vulnerabilities/",
      "date": "2025-08-13T03:47:56Z",
      "description": "Microsoft’s August 2025 Patch Tuesday updates address critical vulnerabilities in Windows, Office, and Hyper-V. The post Microsoft Patches Over 100 Vulnerabilities appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Claude gets 1M tokens support via API to take on Gemini 2.5 Pro",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/claude-gets-1m-tokens-support-via-api-to-take-on-gemini-25-pro/",
      "date": "2025-08-12T22:13:00Z",
      "description": "Claude Sonnet 4 has been upgraded, and it can now remember up to 1 million tokens of context, but only when it's used via API. This could change in the future. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Hackers leak Allianz Life data stolen in Salesforce attacks",
      "link": "https://www.bleepingcomputer.com/news/security/hackers-leak-allianz-life-data-stolen-in-salesforce-attacks/",
      "date": "2025-08-12T22:03:47Z",
      "description": "Hackers have released stolen data belonging to US insurance giant Allianz Life, exposing 2.8 million records with sensitive information on business partners and customers in ongoing Salesforce data theft attacks. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "OpenAI rolls out Gmail, Calendar, and Contacts integration in ChatGPT",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-rolls-out-gmail-calendar-and-contacts-integration-in-chatgpt/",
      "date": "2025-08-12T21:12:39Z",
      "description": "OpenAI wants ChatGPT to know more about you, including your emails, calendar events in Google Calendar and even your Google contacts to reference everything in a conversation. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "ChatGPT's new subscription costs less than $5, but it's not for everyone",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpts-new-subscription-costs-less-than-5-but-its-not-for-everyone/",
      "date": "2025-08-12T21:01:24Z",
      "description": "OpenAI has begun updating its pricing page to include a new plan called 'ChatGPT Go.' It costs 399 INR (Indian Rupee) or roughly $4.55, but there's a catch. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Docker Hub still hosts dozens of Linux images with the XZ backdoor",
      "link": "https://www.bleepingcomputer.com/news/security/docker-hub-still-hosts-dozens-of-linux-images-with-the-xz-backdoor/",
      "date": "2025-08-12T18:43:20Z",
      "description": "The XZ-Utils backdoor, first discovered in March 2024, is still present in at least 35 Linux images on Docker Hub, potentially putting users, organizations, and their data at risk. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Researchers Spot XZ Utils Backdoor in Dozens of Docker Hub Images, Fueling Supply Chain Risks",
      "link": "https://thehackernews.com/2025/08/researchers-spot-xz-utils-backdoor-in.html",
      "date": "2025-08-12T18:17:00Z",
      "description": "New research has uncovered Docker images on Docker Hub that contain the infamous XZ Utils backdoor, more than a year after the discovery of the incident. More troubling is the fact that other images have been built on top of these infected base images, effectively propagating the infection further in a transitive manner, Binarly REsearch said in a report shared with The Hacker News. The firmware",
      "source": "thehackernews.com"
    },
    {
      "title": "Fortinet SSL VPNs Hit by Global Brute-Force Wave Before Attackers Shift to FortiManager",
      "link": "https://thehackernews.com/2025/08/fortinet-ssl-vpns-hit-by-global-brute.html",
      "date": "2025-08-12T17:05:00Z",
      "description": "Cybersecurity researchers are warning of a \"significant spike\" in brute-force traffic aimed at Fortinet SSL VPN devices. The coordinated activity, per threat intelligence firm GreyNoise, was observed on August 3, 2025, with over 780 unique IP addresses participating in the effort. As many as 56 unique IP addresses have been detected over the past 24 hours. All the IP addresses have been",
      "source": "thehackernews.com"
    },
    {
      "title": "Inside the Dark Web’s Access Economy: How Hackers Sell the Keys to Enterprise Networks",
      "link": "https://www.securityweek.com/inside-the-dark-webs-access-economy-how-hackers-sell-the-keys-to-enterprise-networks/",
      "date": "2025-08-12T15:05:03Z",
      "description": "Rapid7’s analysis of dark web forums reveals a thriving market where elite hackers sell corporate network access to buyers, turning cybercrime into a streamlined business. The post Inside the Dark Web’s Access Economy: How Hackers Sell the Keys to Enterprise Networks appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Critical macOS Flaw (CVSS 9.8) Bypasses TCC Without Root Access: PoC Published",
      "link": "https://securityonline.info/critical-macos-flaw-cvss-9-8-bypasses-tcc-without-root-access-poc-published/",
      "date": "2025-08-11T10:31:51Z",
      "description": "The post Critical macOS Flaw (CVSS 9.8) Bypasses TCC Without Root Access: PoC Published appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Flaw (CVSS 9.8) in Ubiquiti UniFi Connect EV Stations Allows Remote Code Execution",
      "link": "https://securityonline.info/critical-flaw-cvss-9-8-in-ubiquiti-unifi-connect-ev-stations-allows-remote-code-execution/",
      "date": "2025-08-07T03:45:59Z",
      "description": "The post Critical Flaw (CVSS 9.8) in Ubiquiti UniFi Connect EV Stations Allows Remote Code Execution appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "VirtualBox VM Escape: Integer Overflow Flaw Allows Full Host Takeover, PoC Published",
      "link": "https://securityonline.info/virtualbox-vm-escape-integer-overflow-flaw-allows-full-host-takeover-poc-published/",
      "date": "2025-08-06T10:14:36Z",
      "description": "The post VirtualBox VM Escape: Integer Overflow Flaw Allows Full Host Takeover, PoC Published appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Dell DD OS Flaw (CVSS 9.8) Allows Unauthenticated Remote Access",
      "link": "https://securityonline.info/critical-dell-dd-os-flaw-cvss-9-8-allows-unauthenticated-remote-access/",
      "date": "2025-08-05T00:16:34Z",
      "description": "The post Critical Dell DD OS Flaw (CVSS 9.8) Allows Unauthenticated Remote Access appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Rtpengine Flaws (CVE-2025-53399) Allow Audio Interception and Injection in VoIP Calls, PoC Publishes",
      "link": "https://securityonline.info/critical-rtpengine-flaws-cve-2025-53399-allow-audio-interception-and-injection-in-voip-calls-poc-publishes/",
      "date": "2025-07-31T09:03:06Z",
      "description": "The post Critical Rtpengine Flaws (CVE-2025-53399) Allow Audio Interception and Injection in VoIP Calls, PoC Publishes appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "date": "2022-08-31T12:57:48Z",
      "description": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "source": "threatpost.com"
    },
    {
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "date": "2022-08-30T16:00:43Z",
      "description": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "source": "threatpost.com"
    },
    {
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "date": "2022-08-29T14:56:19Z",
      "description": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "source": "threatpost.com"
    },
    {
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "date": "2022-08-26T16:44:27Z",
      "description": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "source": "threatpost.com"
    },
    {
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "date": "2022-08-25T18:47:15Z",
      "description": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "source": "threatpost.com"
    }
  ]
}