{
  "last_updated": "2025-08-14T11:32:55Z",
  "count": 40,
  "items": [
    {
      "title": "Xerox FreeFlow Core Vulnerability Let Remote Attackers Execute Malicious Code – PoC Released",
      "link": "https://cybersecuritynews.com/xerox-freeflow-core-vulnerability/",
      "date": "2025-08-14T11:18:40Z",
      "description": "Critical vulnerabilities in Xerox FreeFlow Core, a widely-used print orchestration platform, allow unauthenticated remote attackers to execute malicious code on vulnerable systems. The flaws, tracked as CVE-2025-8355 and CVE-2025-8356, affect the JMF Client service and have been patched in FreeFlow Core version 8.0.5. Key Takeaways1. Two critical vulnerabilities in Xerox FreeFlow Core allow…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks",
      "link": "https://www.securityweek.com/madeyoureset-http2-vulnerability-enables-massive-ddos-attacks/",
      "date": "2025-08-14T11:11:46Z",
      "description": "The new DDoS attack vector, which involves HTTP/2 implementation flaws, has been compared to Rapid Reset. The post ‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Splunk Release Guide for Defenders to Detect Suspicious Activity Before ESXi Ransomware Attack",
      "link": "https://cybersecuritynews.com/esxi-ransomware-attack-guide/",
      "date": "2025-08-14T11:07:28Z",
      "description": "A detailed security guide released by Splunk to help cybersecurity teams detect and prevent ransomware attacks targeting ESXi infrastructure before they can cause catastrophic damage. The guide comes as a response to increasing threats against VMware’s ESXi hypervisor systems, which have become prime targets for cybercriminals due to their centralized nature and often inadequate monitoring. […]…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Leak: OpenAI's browser will use ChatGPT Agent to control the browser",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-openais-browser-will-use-chatgpt-agent-to-control-the-browser/",
      "date": "2025-08-14T10:45:32Z",
      "description": "OpenAI is building an agentic future with its upcoming Chromium-based browser and a new leak confirms GPT Agent integration. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Simple Steps for Attack Surface Reduction",
      "link": "https://thehackernews.com/2025/08/simple-steps-for-attack-surface.html",
      "date": "2025-08-14T09:30:00Z",
      "description": "Story teaser text: Cybersecurity leaders face mounting pressure to stop attacks before they start, and the best defense may come down to the settings you choose on day one. In this piece, Yuriy Tsibere explores how default policies like deny-by-default, MFA enforcement, and application Ringfencing ™ can eliminate entire categories of risk. From disabling Office macros to blocking outbound server",
      "source": "thehackernews.com"
    },
    {
      "title": "CISA warns of N-able N-central flaws exploited in zero-day attacks",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-n-able-n-central-flaws-exploited-in-zero-day-attacks/",
      "date": "2025-08-14T09:15:14Z",
      "description": "​CISA warned on Wednesday that attackers are actively exploiting two security vulnerabilities in N‑able's N-central remote monitoring and management (RMM) platform. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Passkey Login Bypassed via WebAuthn Process Manipulation",
      "link": "https://www.securityweek.com/passkey-login-bypassed-via-webauthn-process-manipulation/",
      "date": "2025-08-14T09:09:07Z",
      "description": "Researchers at enterprise browser security firm SquareX showed how an attacker can impersonate a user and bypass passkey security. The post Passkey Login Bypassed via WebAuthn Process Manipulation appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Critical WordPress Plugin Vulnerability Exposes 70,000+ Sites to RCE Attacks",
      "link": "https://cybersecuritynews.com/critical-wordpress-plugin-vulnerability-3/",
      "date": "2025-08-14T08:56:26Z",
      "description": "A critical security vulnerability has been discovered in the popular “Database for Contact Form 7, WPforms, Elementor forms” WordPress plugin, potentially exposing over 70,000 websites to remote code execution attacks. The vulnerability, tracked as CVE-2025-7384 with a maximum CVSS score of 9.8, affects all versions up to and including 1.4.3 and was publicly disclosed on […] The post Critical…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "CISA Warns of N-able N-Central Deserialization and Injection Vulnerability Exploited in Attacks",
      "link": "https://cybersecuritynews.com/cisa-warns-of-n-able-n-central-vulnerabilities/",
      "date": "2025-08-14T08:31:39Z",
      "description": "CISA has issued urgent warnings regarding two critical security vulnerabilities in N-able N-Central remote monitoring and management (RMM) software that threat actors are actively exploiting. The vulnerabilities, identified as CVE-2025-8875 and CVE-2025-8876, pose significant risks to organizations using this widely-deployed IT management platform. Key Takeaways1. Two critical N-able N-Central…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "ShinyHunters Possibly Collaborates With Scattered Spider in Salesforce Attack Campaigns",
      "link": "https://cybersecuritynews.com/shinyhunters-possibly-collaborates-with-scattered-spider/",
      "date": "2025-08-14T08:16:01Z",
      "description": "The notorious ShinyHunters cybercriminal group has emerged from a year-long hiatus with a sophisticated new wave of attacks targeting Salesforce platforms across major organizations, including high-profile victims like Google. This resurgence marks a significant tactical evolution for the financially motivated threat actors, who have traditionally focused on database exploitation and credential…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Microsoft fixes Windows 11 24H2 updates failing with 0x80240069 error",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-11-24h2-updates-failing-with-0x80240069-error/",
      "date": "2025-08-14T07:41:20Z",
      "description": "Microsoft has resolved a known issue preventing the August 2025 Windows 11 24H2 cumulative update from being delivered via Windows Server Update Services (WSUS). [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Google Requires Crypto App Licenses in 15 Regions as FBI Warns of $9.9M Scam Losses",
      "link": "https://thehackernews.com/2025/08/google-requires-crypto-app-licenses-in.html",
      "date": "2025-08-14T06:46:00Z",
      "description": "Google said it's implementing a new policy requiring developers of cryptocurrency exchanges and wallets to obtain government licenses before publishing apps in 15 jurisdictions in order to \"ensure a safe and compliant ecosystem for users.\" The policy applies to markets like Bahrain, Canada, Hong Kong, Indonesia, Israel, Japan, the Philippines, South Africa, South Korea, Switzerland, Thailand,",
      "source": "thehackernews.com"
    },
    {
      "title": "CISA Adds Two N-able N-central Flaws to Known Exploited Vulnerabilities Catalog",
      "link": "https://thehackernews.com/2025/08/cisa-adds-two-n-able-n-central-flaws-to.html",
      "date": "2025-08-14T04:02:00Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added two security flaws impacting N-able N-central to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation. N-able N-central is a Remote Monitoring and Management (RMM) platform designed for Managed Service Providers (MSPs), allowing customers to efficiently manage and secure",
      "source": "thehackernews.com"
    },
    {
      "title": "Google Gemini's Deep Research is finally coming to API",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-geminis-deep-research-is-finally-coming-to-api/",
      "date": "2025-08-14T01:01:01Z",
      "description": "Google Gemini's one of the most powerful features is Deep Research, but up until now, it has been strictly limited to the Gemini interface. This could change soon. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "North Korea Attacks South Koreans With Ransomware",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/north-korea-attacks-south-koreans-ransomware",
      "date": "2025-08-14T00:00:00Z",
      "description": "DPRK hackers are throwing every kind of malware at the wall and seeing what sticks, deploying stealers, backdoors, and ransomware all at once.",
      "source": "darkreading.com"
    },
    {
      "title": "OpenAI relaxes GPT-5 rate limit, promises to improve the personality",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-relaxes-gpt-5-rate-limit-promises-to-improve-the-personality/",
      "date": "2025-08-13T22:22:04Z",
      "description": "OpenAI is slowly addressing all concerns around GPT-5, including rate limits and now its personality, which has been criticized for being less affirmative. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Fortinet Products Are in the Crosshairs Again",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/fortinet-products-in-crosshairs-again",
      "date": "2025-08-13T21:15:49Z",
      "description": "The company disclosed a critical FortiSIEM flaw with a PoC exploit for it the same week researchers warned of an ominous surge in malicious traffic targeting the vendor's SSL VPNs.",
      "source": "darkreading.com"
    },
    {
      "title": "Whispers of XZ Utils Backdoor Live on in Old Docker Images",
      "link": "https://www.darkreading.com/vulnerabilities-threats/xz-utils-backdoor-live-old-docker-images",
      "date": "2025-08-13T20:09:03Z",
      "description": "Developers maintaining the images made the \"intentional choice\" to leave the artifacts available as \"a historical curiosity,\" given the improbability they'd be exploited.",
      "source": "darkreading.com"
    },
    {
      "title": "Norwegian Police Say Pro-Russian Hackers Were Likely Behind Suspected Sabotage at a Dam",
      "link": "https://www.securityweek.com/norwegian-police-say-pro-russian-hackers-were-likely-behind-suspected-sabotage-at-a-dam/",
      "date": "2025-08-13T20:05:00Z",
      "description": "During the April incident, hackers gained access to a digital system which remotely controls one of the dam’s valves and opened it to increase the water flow. The post Norwegian Police Say Pro-Russian Hackers Were Likely Behind Suspected Sabotage at a Dam appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Popular AI Systems Still a Work-in-Progress for Security",
      "link": "https://www.darkreading.com/vulnerabilities-threats/popular-ai-systems-still-work-in-progress-security",
      "date": "2025-08-13T19:08:09Z",
      "description": "According to a recent Forescout analysis, open source models were significantly less successful in vulnerability research than commercial and underground models.",
      "source": "darkreading.com"
    },
    {
      "title": "Patch Now: Attackers Target OT Networks via Critical RCE Flaw",
      "link": "https://www.darkreading.com/ics-ot-security/patch-now-attackers-target-ot-networks-critical-rce-flaw",
      "date": "2025-08-13T16:36:04Z",
      "description": "Researchers observed exploitation attempts against a vulnerability with a CVSS score of 10 in a popular Erlang-based platform for critical infrastructure and OT development.",
      "source": "darkreading.com"
    },
    {
      "title": "New PS1Bot Malware Campaign Uses Malvertising to Deploy Multi-Stage In-Memory Attacks",
      "link": "https://thehackernews.com/2025/08/new-ps1bot-malware-campaign-uses.html",
      "date": "2025-08-13T15:46:00Z",
      "description": "Cybersecurity researchers have discovered a new malvertising campaign that's designed to infect victims with a multi-stage malware framework called PS1Bot. \"PS1Bot features a modular design, with several modules delivered used to perform a variety of malicious activities on infected systems, including information theft, keylogging, reconnaissance, and the establishment of persistent system",
      "source": "thehackernews.com"
    },
    {
      "title": "Zoom and Xerox Release Critical Security Updates Fixing Privilege Escalation and RCE Flaws",
      "link": "https://thehackernews.com/2025/08/zoom-and-xerox-release-critical.html",
      "date": "2025-08-13T13:19:00Z",
      "description": "Zoom and Xerox have addressed critical security flaws in Zoom Clients for Windows and FreeFlow Core that could allow privilege escalation and remote code execution. The vulnerability impacting Zoom Clients for Windows, tracked as CVE-2025-49457 (CVSS score: 9.6), relates to a case of an untrusted search path that could pave the way for privilege escalation. \"Untrusted search path in",
      "source": "thehackernews.com"
    },
    {
      "title": "Chipmaker Patch Tuesday: Many Vulnerabilities Addressed by Intel, AMD, Nvidia",
      "link": "https://www.securityweek.com/chipmaker-patch-tuesday-many-vulnerabilities-addressed-by-intel-amd-nvidia/",
      "date": "2025-08-13T12:29:01Z",
      "description": "Intel, AMD and Nvidia have published security advisories describing vulnerabilities found recently in their products. The post Chipmaker Patch Tuesday: Many Vulnerabilities Addressed by Intel, AMD, Nvidia appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "New Zero-Click Flaw Bypasses Microsoft’s Patch, Leaking NTLM Credentials, PoC Available",
      "link": "https://securityonline.info/new-zero-click-flaw-bypasses-microsofts-patch-leaking-ntlm-credentials-poc-available/",
      "date": "2025-08-13T11:14:18Z",
      "description": "The post New Zero-Click Flaw Bypasses Microsoft’s Patch, Leaking NTLM Credentials, PoC Available appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Manpower Says Data Breach Stemming From Ransomware Attack Impacts 140,000",
      "link": "https://www.securityweek.com/manpower-says-data-breach-stemming-from-ransomware-attack-impacts-140000/",
      "date": "2025-08-13T11:10:35Z",
      "description": "The RansomHub ransomware group stole sensitive information from staffing and recruiting firm Manpower in January. The post Manpower Says Data Breach Stemming From Ransomware Attack Impacts 140,000 appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "ZDI-CAN-27349: Siemens",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-12T05:00:00Z",
      "description": "A CVSS score 7.8 AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Rocco Calvi (@TecR0c) with TecSecurity' was reported to the affected vendor on: 2025-08-12, 2 days ago. The vendor is given until 2025-12-10 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-27857: NVIDIA",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-12T05:00:00Z",
      "description": "A CVSS score 7.5 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N severity vulnerability discovered by 'Peter Girnus (@gothburz) of Trend Zero Day Initiative' was reported to the affected vendor on: 2025-08-12, 2 days ago. The vendor is given until 2025-12-10 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-27874: NVIDIA",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-12T05:00:00Z",
      "description": "A CVSS score 7.5 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N severity vulnerability discovered by 'Peter Girnus (@gothburz) of Trend Zero Day Initiative' was reported to the affected vendor on: 2025-08-12, 2 days ago. The vendor is given until 2025-12-10 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-27858: NVIDIA",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-12T05:00:00Z",
      "description": "A CVSS score 9.8 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Peter Girnus (@gothburz) of Trend Zero Day Initiative' was reported to the affected vendor on: 2025-08-12, 2 days ago. The vendor is given until 2025-12-10 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-27146: Siemens",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-12T05:00:00Z",
      "description": "A CVSS score 7.8 AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Rocco Calvi (@TecR0c) with TecSecurity' was reported to the affected vendor on: 2025-08-12, 2 days ago. The vendor is given until 2025-12-10 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "Critical macOS Flaw (CVSS 9.8) Bypasses TCC Without Root Access: PoC Published",
      "link": "https://securityonline.info/critical-macos-flaw-cvss-9-8-bypasses-tcc-without-root-access-poc-published/",
      "date": "2025-08-11T10:31:51Z",
      "description": "The post Critical macOS Flaw (CVSS 9.8) Bypasses TCC Without Root Access: PoC Published appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Flaw (CVSS 9.8) in Ubiquiti UniFi Connect EV Stations Allows Remote Code Execution",
      "link": "https://securityonline.info/critical-flaw-cvss-9-8-in-ubiquiti-unifi-connect-ev-stations-allows-remote-code-execution/",
      "date": "2025-08-07T03:45:59Z",
      "description": "The post Critical Flaw (CVSS 9.8) in Ubiquiti UniFi Connect EV Stations Allows Remote Code Execution appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "VirtualBox VM Escape: Integer Overflow Flaw Allows Full Host Takeover, PoC Published",
      "link": "https://securityonline.info/virtualbox-vm-escape-integer-overflow-flaw-allows-full-host-takeover-poc-published/",
      "date": "2025-08-06T10:14:36Z",
      "description": "The post VirtualBox VM Escape: Integer Overflow Flaw Allows Full Host Takeover, PoC Published appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Dell DD OS Flaw (CVSS 9.8) Allows Unauthenticated Remote Access",
      "link": "https://securityonline.info/critical-dell-dd-os-flaw-cvss-9-8-allows-unauthenticated-remote-access/",
      "date": "2025-08-05T00:16:34Z",
      "description": "The post Critical Dell DD OS Flaw (CVSS 9.8) Allows Unauthenticated Remote Access appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "date": "2022-08-31T12:57:48Z",
      "description": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "source": "threatpost.com"
    },
    {
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "date": "2022-08-30T16:00:43Z",
      "description": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "source": "threatpost.com"
    },
    {
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "date": "2022-08-29T14:56:19Z",
      "description": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "source": "threatpost.com"
    },
    {
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "date": "2022-08-26T16:44:27Z",
      "description": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "source": "threatpost.com"
    },
    {
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "date": "2022-08-25T18:47:15Z",
      "description": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "source": "threatpost.com"
    }
  ]
}