{
  "last_updated": "2025-08-14T14:47:59Z",
  "count": 40,
  "items": [
    {
      "title": "Booking.com phishing campaign uses sneaky 'ん' character to trick you",
      "link": "https://www.bleepingcomputer.com/news/security/bookingcom-phishing-campaign-uses-sneaky-character-to-trick-you/",
      "date": "2025-08-14T14:23:45Z",
      "description": "Threat actors are leveraging a Unicode character to make phishing links appear like legitimate Booking.com links in a new campaign distributing malware. The attack makes use of the Japanese hiragana character, ん, which can, on some systems, appear as a forward slash and make a phishing URL appear realistic to a person at first. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "When Theft Replaces Encryption: Blue Report 2025 on Ransomware & Infostealers",
      "link": "https://www.bleepingcomputer.com/news/security/when-theft-replaces-encryption-blue-report-2025-on-ransomware-and-infostealers/",
      "date": "2025-08-14T14:01:11Z",
      "description": "Ransomware and infostealers are winning on stealth, not encryption. Picus Blue Report 2025 reveals just 3% of data exfiltration attempts are stopped. Find and fix your biggest exposure gaps before they're exploited. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Vulnerabilities in Xerox Print Orchestration Product Allow Remote Code Execution",
      "link": "https://www.securityweek.com/vulnerabilities-in-xerox-print-orchestration-product-allow-remote-code-execution/",
      "date": "2025-08-14T13:47:57Z",
      "description": "Path traversal and XXE injection flaws allowing unauthenticated remote code execution have been patched in Xerox FreeFlow Core. The post Vulnerabilities in Xerox Print Orchestration Product Allow Remote Code Execution appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Apache Tomcat Vulnerabilities Let Attackers Trigger Dos Attack",
      "link": "https://cybersecuritynews.com/apache-tomcat-dos-vulnerabilities-2/",
      "date": "2025-08-14T13:45:48Z",
      "description": "A critical security vulnerability in Apache Tomcat’s HTTP/2 implementation has been discovered, enabling attackers to launch devastating denial-of-service (DoS) attacks against web servers. The vulnerability, designated as CVE-2025-48989 and dubbed the “Made You Reset” attack, affects multiple versions of the popular Java servlet container and poses significant risks to web applications…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Adobe’s August 2025 Patch Tuesday – 60 Vulnerabilities Patches Across Multiple Products",
      "link": "https://cybersecuritynews.com/adobe-vulnerabilities-patches-across-multiple-products/",
      "date": "2025-08-14T13:28:10Z",
      "description": "Adobe has released a comprehensive security update addressing 60 critical vulnerabilities across 13 of its flagship products as part of its August 2025 Patch Tuesday initiative. The massive security bulletin, published on August 12, 2025, represents one of the most significant coordinated vulnerability disclosure events in Adobe’s recent history, affecting everything from Creative Cloud…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Hackers Found Using CrossC2 to Expand Cobalt Strike Beacon’s Reach to Linux and macOS",
      "link": "https://thehackernews.com/2025/08/researchers-warn-crossc2-expands-cobalt.html",
      "date": "2025-08-14T13:16:00Z",
      "description": "Japan's CERT coordination center (JPCERT/CC) on Thursday revealed it observed incidents that involved the use of a command-and-control (C2) framework called CrossC2, which is designed to extend the functionality of Cobalt Strike to other platforms like Linux and Apple macOS for cross-platform system control. The agency said the activity was detected between September and December 2024, targeting",
      "source": "thehackernews.com"
    },
    {
      "title": "Canada’s House of Commons investigating data breach after cyberattack",
      "link": "https://www.bleepingcomputer.com/news/security/canadas-house-of-commons-investigating-data-breach-after-cyberattack/",
      "date": "2025-08-14T13:06:43Z",
      "description": "The House of Commons of Canada is currently investigating a data breach after a threat actor reportedly stole employee information in a cyberattack on Friday. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "How ShinyHunters Breached Google, Adidas, Louis Vuitton and More in Ongoing Salesforce Attack Campaign",
      "link": "https://cybersecuritynews.com/shinyhunters-breaches/",
      "date": "2025-08-14T13:06:39Z",
      "description": "The cybersecurity landscape witnessed a sophisticated and ongoing attack campaign throughout 2025 that has successfully compromised major corporations, including Google, Adidas, Louis Vuitton, and numerous other high-profile organizations. This comprehensive technical analysis reveals how the notorious cybercriminal group ShinyHunters, in apparent collaboration with Scattered Spider, has…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "SmartLoader Malware via Github Repository as Legitimate Projects Infection Users Computer",
      "link": "https://cybersecuritynews.com/smartloader-malware-via-github-repository/",
      "date": "2025-08-14T13:05:04Z",
      "description": "Cybersecurity researchers have uncovered a sophisticated malware distribution campaign utilizing GitHub repositories disguised as legitimate software projects. The SmartLoader malware has been strategically deployed across multiple repositories, capitalizing on users’ trust in the popular code-sharing platform to infiltrate systems worldwide. The malicious campaign targets users searching for…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "CISA Warns of Attacks Exploiting N-able Vulnerabilities",
      "link": "https://www.securityweek.com/cisa-warns-of-attacks-exploiting-n-able-vulnerabilities/",
      "date": "2025-08-14T12:29:38Z",
      "description": "CISA reported becoming aware of attacks exploiting CVE-2025-8875 and CVE-2025-8876 in N-able N-central on the day they were patched. The post CISA Warns of Attacks Exploiting N-able Vulnerabilities appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Hackers Using Dedicated Phishlet to Launch FIDO Authentication Downgrade Attacks",
      "link": "https://cybersecuritynews.com/hackers-using-dedicated-phishlet/",
      "date": "2025-08-14T11:40:32Z",
      "description": "A sophisticated new threat vector has emerged that could undermine one of the most trusted authentication methods in cybersecurity. FIDO-based passkeys, long considered the gold standard for phishing-resistant authentication, are now facing a potentially devastating attack technique that forces users to downgrade to less secure authentication methods. The attack exploits a critical vulnerability…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Have You Turned Off Your Virtual Oven?",
      "link": "https://thehackernews.com/2025/08/have-you-turned-off-your-virtual-oven.html",
      "date": "2025-08-14T11:25:00Z",
      "description": "You check that the windows are shut before leaving home. Return to the kitchen to verify that the oven and stove were definitely turned off. Maybe even circle back again to confirm the front door was properly closed. These automatic safety checks give you peace of mind because you know the unlikely but potentially dangerous consequences of forgetting – a break-in, fire, or worse. Your",
      "source": "thehackernews.com"
    },
    {
      "title": "‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks",
      "link": "https://www.securityweek.com/madeyoureset-http2-vulnerability-enables-massive-ddos-attacks/",
      "date": "2025-08-14T11:11:46Z",
      "description": "The new DDoS attack vector, which involves HTTP/2 implementation flaws, has been compared to Rapid Reset. The post ‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "New Android Malware Wave Hits Banking via NFC Relay Fraud, Call Hijacking, and Root Exploits",
      "link": "https://thehackernews.com/2025/08/new-android-malware-wave-hits-banking.html",
      "date": "2025-08-14T11:06:00Z",
      "description": "Cybersecurity researchers have disclosed a new Android trojan called PhantomCard that abuses near-field communication (NFC) to conduct relay attacks for facilitating fraudulent transactions in attacks targeting banking customers in Brazil. \"PhantomCard relays NFC data from a victim's banking card to the fraudster's device,\" ThreatFabric said in a report. \"PhantomCard is based on",
      "source": "thehackernews.com"
    },
    {
      "title": "Leak: OpenAI's browser will use ChatGPT Agent to control the browser",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-openais-browser-will-use-chatgpt-agent-to-control-the-browser/",
      "date": "2025-08-14T10:45:32Z",
      "description": "OpenAI is building an agentic future with its upcoming Chromium-based browser and a new leak confirms GPT Agent integration. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Simple Steps for Attack Surface Reduction",
      "link": "https://thehackernews.com/2025/08/simple-steps-for-attack-surface.html",
      "date": "2025-08-14T09:30:00Z",
      "description": "Story teaser text: Cybersecurity leaders face mounting pressure to stop attacks before they start, and the best defense may come down to the settings you choose on day one. In this piece, Yuriy Tsibere explores how default policies like deny-by-default, MFA enforcement, and application Ringfencing ™ can eliminate entire categories of risk. From disabling Office macros to blocking outbound server",
      "source": "thehackernews.com"
    },
    {
      "title": "CISA warns of N-able N-central flaws exploited in zero-day attacks",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-n-able-n-central-flaws-exploited-in-zero-day-attacks/",
      "date": "2025-08-14T09:15:14Z",
      "description": "​CISA warned on Wednesday that attackers are actively exploiting two security vulnerabilities in N‑able's N-central remote monitoring and management (RMM) platform. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Passkey Login Bypassed via WebAuthn Process Manipulation",
      "link": "https://www.securityweek.com/passkey-login-bypassed-via-webauthn-process-manipulation/",
      "date": "2025-08-14T09:09:07Z",
      "description": "Researchers at enterprise browser security firm SquareX showed how an attacker can impersonate a user and bypass passkey security. The post Passkey Login Bypassed via WebAuthn Process Manipulation appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Google Requires Crypto App Licenses in 15 Regions as FBI Warns of $9.9M Scam Losses",
      "link": "https://thehackernews.com/2025/08/google-requires-crypto-app-licenses-in.html",
      "date": "2025-08-14T06:46:00Z",
      "description": "Google said it's implementing a new policy requiring developers of cryptocurrency exchanges and wallets to obtain government licenses before publishing apps in 15 jurisdictions in order to \"ensure a safe and compliant ecosystem for users.\" The policy applies to markets like Bahrain, Canada, Hong Kong, Indonesia, Israel, Japan, the Philippines, South Africa, South Korea, Switzerland, Thailand,",
      "source": "thehackernews.com"
    },
    {
      "title": "ZDI-CAN-27786: Katana Network",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 9.8 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Peter Girnus (@gothburz) of Trend Research' was reported to the affected vendor on: 2025-08-14, 0 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-22274: Hexo",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 3.7 AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N severity vulnerability discovered by 'Grigory Dorodnov of Trend Micro Security Research' was reported to the affected vendor on: 2025-08-14, 0 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-27784: github-kanban-mcp-server",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 9.8 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Brandon Niemczyk & Peter Girnus (@gothburz) of Trend Zero Day Initiative' was reported to the affected vendor on: 2025-08-14, 0 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "North Korea Attacks South Koreans With Ransomware",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/north-korea-attacks-south-koreans-ransomware",
      "date": "2025-08-14T00:00:00Z",
      "description": "DPRK hackers are throwing every kind of malware at the wall and seeing what sticks, deploying stealers, backdoors, and ransomware all at once.",
      "source": "darkreading.com"
    },
    {
      "title": "Fortinet Products Are in the Crosshairs Again",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/fortinet-products-in-crosshairs-again",
      "date": "2025-08-13T21:15:49Z",
      "description": "The company disclosed a critical FortiSIEM flaw with a PoC exploit for it the same week researchers warned of an ominous surge in malicious traffic targeting the vendor's SSL VPNs.",
      "source": "darkreading.com"
    },
    {
      "title": "Whispers of XZ Utils Backdoor Live on in Old Docker Images",
      "link": "https://www.darkreading.com/vulnerabilities-threats/xz-utils-backdoor-live-old-docker-images",
      "date": "2025-08-13T20:09:03Z",
      "description": "Developers maintaining the images made the \"intentional choice\" to leave the artifacts available as \"a historical curiosity,\" given the improbability they'd be exploited.",
      "source": "darkreading.com"
    },
    {
      "title": "Norwegian Police Say Pro-Russian Hackers Were Likely Behind Suspected Sabotage at a Dam",
      "link": "https://www.securityweek.com/norwegian-police-say-pro-russian-hackers-were-likely-behind-suspected-sabotage-at-a-dam/",
      "date": "2025-08-13T20:05:00Z",
      "description": "During the April incident, hackers gained access to a digital system which remotely controls one of the dam’s valves and opened it to increase the water flow. The post Norwegian Police Say Pro-Russian Hackers Were Likely Behind Suspected Sabotage at a Dam appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Popular AI Systems Still a Work-in-Progress for Security",
      "link": "https://www.darkreading.com/vulnerabilities-threats/popular-ai-systems-still-work-in-progress-security",
      "date": "2025-08-13T19:08:09Z",
      "description": "According to a recent Forescout analysis, open source models were significantly less successful in vulnerability research than commercial and underground models.",
      "source": "darkreading.com"
    },
    {
      "title": "Patch Now: Attackers Target OT Networks via Critical RCE Flaw",
      "link": "https://www.darkreading.com/ics-ot-security/patch-now-attackers-target-ot-networks-critical-rce-flaw",
      "date": "2025-08-13T16:36:04Z",
      "description": "Researchers observed exploitation attempts against a vulnerability with a CVSS score of 10 in a popular Erlang-based platform for critical infrastructure and OT development.",
      "source": "darkreading.com"
    },
    {
      "title": "New Zero-Click Flaw Bypasses Microsoft’s Patch, Leaking NTLM Credentials, PoC Available",
      "link": "https://securityonline.info/new-zero-click-flaw-bypasses-microsofts-patch-leaking-ntlm-credentials-poc-available/",
      "date": "2025-08-13T11:14:18Z",
      "description": "The post New Zero-Click Flaw Bypasses Microsoft’s Patch, Leaking NTLM Credentials, PoC Available appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "ZDI-CAN-27349: Siemens",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-12T05:00:00Z",
      "description": "A CVSS score 7.8 AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Rocco Calvi (@TecR0c) with TecSecurity' was reported to the affected vendor on: 2025-08-12, 2 days ago. The vendor is given until 2025-12-10 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-27857: NVIDIA",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-12T05:00:00Z",
      "description": "A CVSS score 7.5 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N severity vulnerability discovered by 'Peter Girnus (@gothburz) of Trend Zero Day Initiative' was reported to the affected vendor on: 2025-08-12, 2 days ago. The vendor is given until 2025-12-10 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "Critical macOS Flaw (CVSS 9.8) Bypasses TCC Without Root Access: PoC Published",
      "link": "https://securityonline.info/critical-macos-flaw-cvss-9-8-bypasses-tcc-without-root-access-poc-published/",
      "date": "2025-08-11T10:31:51Z",
      "description": "The post Critical macOS Flaw (CVSS 9.8) Bypasses TCC Without Root Access: PoC Published appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Flaw (CVSS 9.8) in Ubiquiti UniFi Connect EV Stations Allows Remote Code Execution",
      "link": "https://securityonline.info/critical-flaw-cvss-9-8-in-ubiquiti-unifi-connect-ev-stations-allows-remote-code-execution/",
      "date": "2025-08-07T03:45:59Z",
      "description": "The post Critical Flaw (CVSS 9.8) in Ubiquiti UniFi Connect EV Stations Allows Remote Code Execution appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "VirtualBox VM Escape: Integer Overflow Flaw Allows Full Host Takeover, PoC Published",
      "link": "https://securityonline.info/virtualbox-vm-escape-integer-overflow-flaw-allows-full-host-takeover-poc-published/",
      "date": "2025-08-06T10:14:36Z",
      "description": "The post VirtualBox VM Escape: Integer Overflow Flaw Allows Full Host Takeover, PoC Published appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Dell DD OS Flaw (CVSS 9.8) Allows Unauthenticated Remote Access",
      "link": "https://securityonline.info/critical-dell-dd-os-flaw-cvss-9-8-allows-unauthenticated-remote-access/",
      "date": "2025-08-05T00:16:34Z",
      "description": "The post Critical Dell DD OS Flaw (CVSS 9.8) Allows Unauthenticated Remote Access appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "date": "2022-08-31T12:57:48Z",
      "description": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "source": "threatpost.com"
    },
    {
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "date": "2022-08-30T16:00:43Z",
      "description": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "source": "threatpost.com"
    },
    {
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "date": "2022-08-29T14:56:19Z",
      "description": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "source": "threatpost.com"
    },
    {
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "date": "2022-08-26T16:44:27Z",
      "description": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "source": "threatpost.com"
    },
    {
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "date": "2022-08-25T18:47:15Z",
      "description": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "source": "threatpost.com"
    }
  ]
}