{
  "last_updated": "2025-08-15T08:52:35Z",
  "count": 40,
  "items": [
    {
      "title": "US sanctions Grinex crypto-exchange, Garantex’s successor",
      "link": "https://www.bleepingcomputer.com/news/security/us-sanctions-grinex-crypto-exchange-garantexs-successor/",
      "date": "2025-08-15T08:46:59Z",
      "description": "The U.S. Department of the Treasury has announced sanctions against Grinex, the successor to Russian cryptocurrency exchange Garantex, which was previously sanctioned for helping ransomware gangs launder their money. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Critical Flaws Patched in Rockwell FactoryTalk, Micro800, ControlLogix Products",
      "link": "https://www.securityweek.com/critical-flaws-patched-in-rockwell-factorytalk-micro800-controllogix-products/",
      "date": "2025-08-15T08:33:50Z",
      "description": "Rockwell Automation has published several advisories describing critical and high-severity vulnerabilities affecting its products. The post Critical Flaws Patched in Rockwell FactoryTalk, Micro800, ControlLogix Products appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "HexStrike AI Connects ChatGPT, Claude, Copilot with 150+ Security Tools like Burp Suite and Nmap",
      "link": "https://cybersecuritynews.com/hexstrike-ai/",
      "date": "2025-08-15T08:26:02Z",
      "description": "A new AI tool named HexStrike AI has been launched, designed to bridge the gap between large language models (LLMs) and practical cybersecurity operations. The latest release, v6.0, equips AI agents like OpenAI’s GPT, Anthropic’s Claude, and GitHub’s Copilot with a formidable arsenal of over 150 professional security tools, enabling autonomous penetration testing, vulnerability research, […] The…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Cisco Secure Firewall Snort 3 Detection Engine Vulnerability Enables DoS Attacks",
      "link": "https://cybersecuritynews.com/snort-3-detection-engine-vulnerability/",
      "date": "2025-08-15T07:56:38Z",
      "description": "Critical security flaw CVE-2025-20217 allows unauthenticated attackers to trigger denial-of-service conditions in Cisco’s widely deployed firewall systems Cisco has disclosed a high-severity vulnerability in its Secure Firewall Threat Defense (FTD) Software that could allow remote attackers to cause denial-of-service conditions through the Snort 3 Detection Engine. The vulnerability, tracked as…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "10 Best Deception Tools in 2025",
      "link": "https://cybersecuritynews.com/deception-tools/",
      "date": "2025-08-15T07:54:50Z",
      "description": "The goal of deception technology, which uses some of the best deception tools, is to trick attackers by dispersing a variety of traps and dummy assets throughout a system’s infrastructure to mimic real assets. There is always a possibility that cybercriminals will breach your network, regardless of how effective your perimeter defenses. You’ll lure them […] The post 10 Best Deception Tools in…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Cisco Patches Critical Vulnerability in Firewall Management Platform",
      "link": "https://www.securityweek.com/cisco-patches-critical-vulnerability-in-firewall-management-platform/",
      "date": "2025-08-15T07:45:30Z",
      "description": "Cisco has released over 20 advisories as part of its August 2025 bundled publication for ASA, FMC and FTD products. The post Cisco Patches Critical Vulnerability in Firewall Management Platform appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "CVE-2025-8088 – WinRAR 0-Day Path Traversal Vulnerability Exploited to Execute Malware",
      "link": "https://cybersecuritynews.com/winrar-0-day-exploited/",
      "date": "2025-08-15T07:23:12Z",
      "description": "A zero-day vulnerability in WinRAR allows malware to be deployed on unsuspecting users’ systems, highlighting the ongoing threats to popular software. Tracked as CVE-2025-8088, this path traversal flaw affects the Windows version of the widely used file archiving tool, enabling attackers to execute arbitrary code through specially crafted archives. The vulnerability, discovered in mid-July 2025,…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Cisco Warns of CVSS 10.0 FMC RADIUS Flaw Allowing Remote Code Execution",
      "link": "https://thehackernews.com/2025/08/cisco-warns-of-cvss-100-fmc-radius-flaw.html",
      "date": "2025-08-15T06:49:00Z",
      "description": "Cisco has released security updates to address a maximum-severity security flaw in Secure Firewall Management Center (FMC) Software that could allow an attacker to execute arbitrary code on affected systems. The vulnerability, assigned the CVE identifier CVE-2025-20265 (CVSS score: 10.0), affects the RADIUS subsystem implementation that could permit an unauthenticated, remote attacker to inject",
      "source": "thehackernews.com"
    },
    {
      "title": "Threat Actors Attacking Windows Systems With New Multi-Stage Malware Framework PS1Bot",
      "link": "https://cybersecuritynews.com/new-multi-stage-malware-framework-ps1bot/",
      "date": "2025-08-15T06:46:40Z",
      "description": "A sophisticated new malware campaign targeting Windows systems has emerged, employing a multi-stage framework dubbed “PS1Bot” that combines PowerShell and C# components to conduct extensive information theft operations. The malware represents a significant evolution in attack methodologies, utilizing modular architecture and in-memory execution techniques to evade traditional detection…",
      "source": "cybersecuritynews.com"
    },
    {
      "title": "Downgrade Attack Allows Phishing Kits to Bypass FIDO",
      "link": "https://www.darkreading.com/cybersecurity-operations/downgrade-attack-phishing-kits-bypass-fido",
      "date": "2025-08-14T21:43:25Z",
      "description": "You probably can't break FIDO authentication. Still, researchers have shown that there are ways to get around it.",
      "source": "darkreading.com"
    },
    {
      "title": "State and Local Leaders Lobby Congress for Cybersecurity Resources",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/state-local-leaders-lobby-congress-cybersecurity-resources",
      "date": "2025-08-14T21:26:01Z",
      "description": "Federal funding cuts to the Multi-State Information Sharing and Analysis Center (MS-ISAC) are about to leave more than 18,000 state and local organizations without access to basic cybersecurity resources they need to protect US national security, a letter sent to Congressional appropriators warns.",
      "source": "darkreading.com"
    },
    {
      "title": "Over $300 million in cybercrime crypto seized in anti-fraud effort",
      "link": "https://www.bleepingcomputer.com/news/security/over-300-million-in-cybercrime-crypto-seized-in-anti-fraud-effort/",
      "date": "2025-08-14T20:15:34Z",
      "description": "More than $300 million worth of cryptocurrency linked to cybercrime and fraud schemes has been frozen due to two separate initiatives involving law enforcement and private companies. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Google Chrome Enterprise: Advanced Browser Security for the Modern Workforce",
      "link": "https://www.darkreading.com/endpoint-security/google-chrome-enterprise-advanced-browser-security-modern-workforce",
      "date": "2025-08-14T20:12:20Z",
      "description": "In this Dark Reading News Desk interview, Google's Mark Berschadski highlights the critical role browsers play in today's work environment and how Chrome Enterprise is evolving to meet modern security challenges while enabling productivity.",
      "source": "darkreading.com"
    },
    {
      "title": "Police &amp; Government Email Access for Sale on Dark Web",
      "link": "https://www.darkreading.com/threat-intelligence/government-email-sale-dark-web",
      "date": "2025-08-14T20:09:03Z",
      "description": "Cybercriminals are auctioning off live email credentials, giving other criminals access to sensitive systems, confidential intelligence, and, potentially, a higher success rate than ever.",
      "source": "darkreading.com"
    },
    {
      "title": "CISA Warns N-able Bugs Under Attack, Patch Now",
      "link": "https://www.darkreading.com/vulnerabilities-threats/n-able-bugs-under-attack",
      "date": "2025-08-14T18:58:41Z",
      "description": "Two critical N-able vulnerabilities enable local code execution and command injection; they require authentication to exploit, suggesting they wouldn't be seen at the beginning of an exploit chain.",
      "source": "darkreading.com"
    },
    {
      "title": "Crypto24 ransomware hits large orgs with custom EDR evasion tool",
      "link": "https://www.bleepingcomputer.com/news/security/crypto24-ransomware-hits-large-orgs-with-custom-edr-evasion-tool/",
      "date": "2025-08-14T17:53:58Z",
      "description": "The Crypto24 ransomware group has been using custom utilities to evade security solutions on breached networks, exfiltrate data, and encrypt files. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Pro-Russian hackers blamed for water dam sabotage in Norway",
      "link": "https://www.bleepingcomputer.com/news/security/pro-russian-hackers-blamed-for-water-dam-sabotage-in-norway/",
      "date": "2025-08-14T16:01:37Z",
      "description": "The Norwegian Police Security Service (PST) says that pro-Russian hackers took control of critical operation systems at a dam and opened outflow valves. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "New HTTP/2 'MadeYouReset' Vulnerability Enables Large-Scale DoS Attacks",
      "link": "https://thehackernews.com/2025/08/new-http2-madeyoureset-vulnerability.html",
      "date": "2025-08-14T15:20:00Z",
      "description": "Multiple HTTP/2 implementations have been found susceptible to a new attack technique called MadeYouReset that could be explored to conduct powerful denial-of-service (DoS) attacks. \"MadeYouReset bypasses the typical server-imposed limit of 100 concurrent HTTP/2 requests per TCP connection from a client. This limit is intended to mitigate DoS attacks by restricting the number of simultaneous",
      "source": "thehackernews.com"
    },
    {
      "title": "Microsoft fixes Windows Server bug causing cluster, VM issues",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-server-bug-causing-cluster-vm-issues/",
      "date": "2025-08-14T15:05:10Z",
      "description": "Microsoft has resolved a known issue that triggers Cluster service and VM restart issues after installing July's Windows Server 2019 security updates. [...]",
      "source": "bleepingcomputer.com"
    },
    {
      "title": "Vulnerabilities in Xerox Print Orchestration Product Allow Remote Code Execution",
      "link": "https://www.securityweek.com/vulnerabilities-in-xerox-print-orchestration-product-allow-remote-code-execution/",
      "date": "2025-08-14T13:47:57Z",
      "description": "Path traversal and XXE injection flaws allowing unauthenticated remote code execution have been patched in Xerox FreeFlow Core. The post Vulnerabilities in Xerox Print Orchestration Product Allow Remote Code Execution appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Hackers Found Using CrossC2 to Expand Cobalt Strike Beacon’s Reach to Linux and macOS",
      "link": "https://thehackernews.com/2025/08/researchers-warn-crossc2-expands-cobalt.html",
      "date": "2025-08-14T13:16:00Z",
      "description": "Japan's CERT coordination center (JPCERT/CC) on Thursday revealed it observed incidents that involved the use of a command-and-control (C2) framework called CrossC2, which is designed to extend the functionality of Cobalt Strike to other platforms like Linux and Apple macOS for cross-platform system control. The agency said the activity was detected between September and December 2024, targeting",
      "source": "thehackernews.com"
    },
    {
      "title": "CISA Warns of Attacks Exploiting N-able Vulnerabilities",
      "link": "https://www.securityweek.com/cisa-warns-of-attacks-exploiting-n-able-vulnerabilities/",
      "date": "2025-08-14T12:29:38Z",
      "description": "CISA reported becoming aware of attacks exploiting CVE-2025-8875 and CVE-2025-8876 in N-able N-central on the day they were patched. The post CISA Warns of Attacks Exploiting N-able Vulnerabilities appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "Have You Turned Off Your Virtual Oven?",
      "link": "https://thehackernews.com/2025/08/have-you-turned-off-your-virtual-oven.html",
      "date": "2025-08-14T11:25:00Z",
      "description": "You check that the windows are shut before leaving home. Return to the kitchen to verify that the oven and stove were definitely turned off. Maybe even circle back again to confirm the front door was properly closed. These automatic safety checks give you peace of mind because you know the unlikely but potentially dangerous consequences of forgetting – a break-in, fire, or worse. Your",
      "source": "thehackernews.com"
    },
    {
      "title": "‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks",
      "link": "https://www.securityweek.com/madeyoureset-http2-vulnerability-enables-massive-ddos-attacks/",
      "date": "2025-08-14T11:11:46Z",
      "description": "The new DDoS attack vector, which involves HTTP/2 implementation flaws, has been compared to Rapid Reset. The post ‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks appeared first on SecurityWeek.",
      "source": "securityweek.com"
    },
    {
      "title": "New Android Malware Wave Hits Banking via NFC Relay Fraud, Call Hijacking, and Root Exploits",
      "link": "https://thehackernews.com/2025/08/new-android-malware-wave-hits-banking.html",
      "date": "2025-08-14T11:06:00Z",
      "description": "Cybersecurity researchers have disclosed a new Android trojan called PhantomCard that abuses near-field communication (NFC) to conduct relay attacks for facilitating fraudulent transactions in attacks targeting banking customers in Brazil. \"PhantomCard relays NFC data from a victim's banking card to the fraudster's device,\" ThreatFabric said in a report. \"PhantomCard is based on",
      "source": "thehackernews.com"
    },
    {
      "title": "ZDI-CAN-27786: Katana Network",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 9.8 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Peter Girnus (@gothburz) of Trend Research' was reported to the affected vendor on: 2025-08-14, 1 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-22274: Hexo",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 3.7 AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N severity vulnerability discovered by 'Grigory Dorodnov of Trend Micro Security Research' was reported to the affected vendor on: 2025-08-14, 1 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-27784: github-kanban-mcp-server",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 9.8 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Brandon Niemczyk & Peter Girnus (@gothburz) of Trend Zero Day Initiative' was reported to the affected vendor on: 2025-08-14, 1 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-26620: Hancom",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 7.8 AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H severity vulnerability discovered by 'rgod' was reported to the affected vendor on: 2025-08-14, 1 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "ZDI-CAN-27894: Apple",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 7.8 AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Nikolai Skliarenko of Trend Micro Security Research' was reported to the affected vendor on: 2025-08-14, 1 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com"
    },
    {
      "title": "New Zero-Click Flaw Bypasses Microsoft’s Patch, Leaking NTLM Credentials, PoC Available",
      "link": "https://securityonline.info/new-zero-click-flaw-bypasses-microsofts-patch-leaking-ntlm-credentials-poc-available/",
      "date": "2025-08-13T11:14:18Z",
      "description": "The post New Zero-Click Flaw Bypasses Microsoft’s Patch, Leaking NTLM Credentials, PoC Available appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical macOS Flaw (CVSS 9.8) Bypasses TCC Without Root Access: PoC Published",
      "link": "https://securityonline.info/critical-macos-flaw-cvss-9-8-bypasses-tcc-without-root-access-poc-published/",
      "date": "2025-08-11T10:31:51Z",
      "description": "The post Critical macOS Flaw (CVSS 9.8) Bypasses TCC Without Root Access: PoC Published appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Flaw (CVSS 9.8) in Ubiquiti UniFi Connect EV Stations Allows Remote Code Execution",
      "link": "https://securityonline.info/critical-flaw-cvss-9-8-in-ubiquiti-unifi-connect-ev-stations-allows-remote-code-execution/",
      "date": "2025-08-07T03:45:59Z",
      "description": "The post Critical Flaw (CVSS 9.8) in Ubiquiti UniFi Connect EV Stations Allows Remote Code Execution appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "VirtualBox VM Escape: Integer Overflow Flaw Allows Full Host Takeover, PoC Published",
      "link": "https://securityonline.info/virtualbox-vm-escape-integer-overflow-flaw-allows-full-host-takeover-poc-published/",
      "date": "2025-08-06T10:14:36Z",
      "description": "The post VirtualBox VM Escape: Integer Overflow Flaw Allows Full Host Takeover, PoC Published appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Critical Dell DD OS Flaw (CVSS 9.8) Allows Unauthenticated Remote Access",
      "link": "https://securityonline.info/critical-dell-dd-os-flaw-cvss-9-8-allows-unauthenticated-remote-access/",
      "date": "2025-08-05T00:16:34Z",
      "description": "The post Critical Dell DD OS Flaw (CVSS 9.8) Allows Unauthenticated Remote Access appeared first on Daily CyberSecurity.",
      "source": "securityonline.info"
    },
    {
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "date": "2022-08-31T12:57:48Z",
      "description": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "source": "threatpost.com"
    },
    {
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "date": "2022-08-30T16:00:43Z",
      "description": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "source": "threatpost.com"
    },
    {
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "date": "2022-08-29T14:56:19Z",
      "description": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "source": "threatpost.com"
    },
    {
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "date": "2022-08-26T16:44:27Z",
      "description": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "source": "threatpost.com"
    },
    {
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "date": "2022-08-25T18:47:15Z",
      "description": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "source": "threatpost.com"
    }
  ]
}