{
  "date": "2025-08-16",
  "count": 4,
  "items": [
    {
      "id": "34b7f55f16a411c809f6ce4001ef0cac2bb11f8a",
      "title": "ERMAC V3.0 Banking Trojan Source Code Leak Exposes Full Malware Infrastructure",
      "link": "https://thehackernews.com/2025/08/ermac-v30-banking-trojan-source-code.html",
      "date": "2025-08-16T10:41:00Z",
      "description": "Cybersecurity researchers have detailed the inner workings of an Android banking trojan called ERMAC 3.0, uncovering serious shortcomings in the operators' infrastructure. \"The newly uncovered version 3.0 reveals a significant evolution of the malware, expanding its form injection and data theft capabilities to target more than 700 banking, shopping, and cryptocurrency applications,\"",
      "source": "thehackernews.com",
      "first_seen": "2025-08-16T11:27:12Z",
      "last_seen": "2025-08-16T11:27:12Z"
    },
    {
      "id": "9a85bb5586dadf4c30be24427ecf285facb3b62f",
      "title": "10 Best API Protection Tools in 2025",
      "link": "https://cybersecuritynews.com/best-api-protection-tools/",
      "date": "2025-08-16T09:22:33Z",
      "description": "API, short for Application Programming Interface, is a mechanism that helps extract data from software applications and transfer it to other software or users using APIs. Communication through APIs is based on different requests and responses, and developers provide good documentation on structuring requests to get the desired response. APIs allow many software/applications to automatically […]…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-16T09:34:00Z",
      "last_seen": "2025-08-16T11:27:12Z"
    },
    {
      "id": "47d6d1e9c78b7137f39be372a9ae9c3ae216729c",
      "title": "Fortinet FortiSIEM Command Injection Vulnerability (CVE-2025-25256) – Technical Details Revealed",
      "link": "https://cybersecuritynews.com/fortinet-fortisiem-command-injection-vulnerability/",
      "date": "2025-08-16T07:55:40Z",
      "description": "Cybersecurity researchers from watchTowr Labs have published a comprehensive technical analysis of a critical pre-authentication command injection vulnerability affecting Fortinet FortiSIEM systems, designated as CVE-2025-25256. The vulnerability carries a maximum CVSS score of 9.8 and has already been exploited in the wild, making it one of the most pressing security threats facing enterprise…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-16T08:48:23Z",
      "last_seen": "2025-08-16T11:27:12Z"
    },
    {
      "id": "33ecc3d97f18c3574a8c27e04bd088c5c8a1c4ec",
      "title": "Russian Group EncryptHub Exploits MSC EvilTwin Vulnerability to Deploy Fickle Stealer Malware",
      "link": "https://thehackernews.com/2025/08/russian-group-encrypthub-exploits-msc.html",
      "date": "2025-08-16T05:34:00Z",
      "description": "The threat actor known as EncryptHub is continuing to exploit a now-patched security flaw impacting Microsoft Windows to deliver malicious payloads. Trustwave SpiderLabs said it recently observed an EncryptHub campaign that brings together social engineering and the exploitation of a vulnerability in the Microsoft Management Console (MMC) framework (CVE-2025-26633, aka MSC EvilTwin) to trigger",
      "source": "thehackernews.com",
      "first_seen": "2025-08-16T06:52:55Z",
      "last_seen": "2025-08-16T11:27:12Z"
    }
  ]
}