{
  "date": "2025-08-15",
  "count": 17,
  "items": [
    {
      "id": "12e7592c503bb043437fae894c8637a30617eab2",
      "title": "US sanctions Grinex crypto-exchange, Garantex’s successor",
      "link": "https://www.bleepingcomputer.com/news/security/us-sanctions-grinex-crypto-exchange-garantexs-successor/",
      "date": "2025-08-15T08:46:59Z",
      "description": "The U.S. Department of the Treasury has announced sanctions against Grinex, the successor to Russian cryptocurrency exchange Garantex, which was previously sanctioned for helping ransomware gangs launder their money. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-15T08:52:35Z",
      "last_seen": "2025-08-15T08:52:35Z"
    },
    {
      "id": "3320f5473a85e7465f4af826223b6ed47153439c",
      "title": "US sanctions Grinex crypto-exchange, successor to Garantex",
      "link": "https://www.bleepingcomputer.com/news/security/us-sanctions-grinex-crypto-exchange-garantexs-successor/",
      "date": "2025-08-15T08:46:59Z",
      "description": "The U.S. Department of the Treasury has announced sanctions against Grinex, the successor to Russian cryptocurrency exchange Garantex, which was previously sanctioned for helping ransomware gangs launder their money. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-15T09:39:54Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "db7cd49bae13c12e7a657173ccc878353a0c47d3",
      "title": "Critical Flaws Patched in Rockwell FactoryTalk, Micro800, ControlLogix Products",
      "link": "https://www.securityweek.com/critical-flaws-patched-in-rockwell-factorytalk-micro800-controllogix-products/",
      "date": "2025-08-15T08:33:50Z",
      "description": "Rockwell Automation has published several advisories describing critical and high-severity vulnerabilities affecting its products. The post Critical Flaws Patched in Rockwell FactoryTalk, Micro800, ControlLogix Products appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-15T08:52:35Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "264ea83a6ea173dc005b975c29634656c7216080",
      "title": "HexStrike AI Connects ChatGPT, Claude, Copilot with 150+ Security Tools like Burp Suite and Nmap",
      "link": "https://cybersecuritynews.com/hexstrike-ai/",
      "date": "2025-08-15T08:26:02Z",
      "description": "A new AI tool named HexStrike AI has been launched, designed to bridge the gap between large language models (LLMs) and practical cybersecurity operations. The latest release, v6.0, equips AI agents like OpenAI’s GPT, Anthropic’s Claude, and GitHub’s Copilot with a formidable arsenal of over 150 professional security tools, enabling autonomous penetration testing, vulnerability research, […] The…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T08:52:35Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "8ce0cf5b57b2807f0539391f8a26db2c1db15037",
      "title": "Cisco Secure Firewall Snort 3 Detection Engine Vulnerability Enables DoS Attacks",
      "link": "https://cybersecuritynews.com/snort-3-detection-engine-vulnerability/",
      "date": "2025-08-15T07:56:38Z",
      "description": "Critical security flaw CVE-2025-20217 allows unauthenticated attackers to trigger denial-of-service conditions in Cisco’s widely deployed firewall systems Cisco has disclosed a high-severity vulnerability in its Secure Firewall Threat Defense (FTD) Software that could allow remote attackers to cause denial-of-service conditions through the Snort 3 Detection Engine. The vulnerability, tracked as…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T08:52:35Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "e74527b52d112e386fe4d9f6820e1d1962546a98",
      "title": "10 Best Deception Tools in 2025",
      "link": "https://cybersecuritynews.com/deception-tools/",
      "date": "2025-08-15T07:54:50Z",
      "description": "The goal of deception technology, which uses some of the best deception tools, is to trick attackers by dispersing a variety of traps and dummy assets throughout a system’s infrastructure to mimic real assets. There is always a possibility that cybercriminals will breach your network, regardless of how effective your perimeter defenses. You’ll lure them […] The post 10 Best Deception Tools in…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T08:52:35Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "52ea7c695aacb8ad477674f9195bd1f70f029451",
      "title": "Cisco Patches Critical Vulnerability in Firewall Management Platform",
      "link": "https://www.securityweek.com/cisco-patches-critical-vulnerability-in-firewall-management-platform/",
      "date": "2025-08-15T07:45:30Z",
      "description": "Cisco has released over 20 advisories as part of its August 2025 bundled publication for ASA, FMC and FTD products. The post Cisco Patches Critical Vulnerability in Firewall Management Platform appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-15T08:52:35Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "c0d1eb5aec9e89f4778c29958f0fb9fe5edf1d61",
      "title": "CVE-2025-8088 – WinRAR 0-Day Path Traversal Vulnerability Exploited to Execute Malware",
      "link": "https://cybersecuritynews.com/winrar-0-day-exploited/",
      "date": "2025-08-15T07:23:12Z",
      "description": "A zero-day vulnerability in WinRAR allows malware to be deployed on unsuspecting users’ systems, highlighting the ongoing threats to popular software. Tracked as CVE-2025-8088, this path traversal flaw affects the Windows version of the widely used file archiving tool, enabling attackers to execute arbitrary code through specially crafted archives. The vulnerability, discovered in mid-July 2025,…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T07:35:55Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "8557a3b4d2c7a6d3eb413bbced7926549afc2509",
      "title": "Cisco Warns of CVSS 10.0 FMC RADIUS Flaw Allowing Remote Code Execution",
      "link": "https://thehackernews.com/2025/08/cisco-warns-of-cvss-100-fmc-radius-flaw.html",
      "date": "2025-08-15T06:49:00Z",
      "description": "Cisco has released security updates to address a maximum-severity security flaw in Secure Firewall Management Center (FMC) Software that could allow an attacker to execute arbitrary code on affected systems. The vulnerability, assigned the CVE identifier CVE-2025-20265 (CVSS score: 10.0), affects the RADIUS subsystem implementation that could permit an unauthenticated, remote attacker to inject",
      "source": "thehackernews.com",
      "first_seen": "2025-08-15T08:52:35Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "e9f11ab5b10454d897d0192f99d4b930a6af21eb",
      "title": "Threat Actors Attacking Windows Systems With New Multi-Stage Malware Framework PS1Bot",
      "link": "https://cybersecuritynews.com/new-multi-stage-malware-framework-ps1bot/",
      "date": "2025-08-15T06:46:40Z",
      "description": "A sophisticated new malware campaign targeting Windows systems has emerged, employing a multi-stage framework dubbed “PS1Bot” that combines PowerShell and C# components to conduct extensive information theft operations. The malware represents a significant evolution in attack methodologies, utilizing modular architecture and in-memory execution techniques to evade traditional detection…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T06:57:14Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "e876378f3412c34d6a124c18f5c4165f8a4e77b8",
      "title": "New HTTP/2 MadeYouReset Vulnerability Enables Large-Scale DDoS Attacks",
      "link": "https://cybersecuritynews.com/http-2-madeyoureset-vulnerability/",
      "date": "2025-08-15T06:12:42Z",
      "description": "Security researchers have identified a new denial-of-service (DoS) vulnerability in HTTP/2 implementations, referred to as MadeYouReset (CVE-2025-8671). This discovery represents a notable escalation in the threats associated with web protocols. Publicly disclosed on August 13, 2025, this flaw allows attackers to bypass built-in concurrency limits, overwhelming servers with unbounded concurrent…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T06:57:14Z",
      "last_seen": "2025-08-15T07:35:55Z"
    },
    {
      "id": "9275f8e6eb22a5da9eceee9e5c53f7b701a0b232",
      "title": "New NFC-Driven PhantomCard Android Malware Attacking Banking Users",
      "link": "https://cybersecuritynews.com/new-nfc-driven-phantomcard-android-malware/",
      "date": "2025-08-15T06:04:25Z",
      "description": "A sophisticated new Android malware dubbed PhantomCard has emerged from the shadows of Brazil’s cybercriminal underground, representing a significant evolution in mobile banking threats. This malicious application leverages Near Field Communication (NFC) technology to create a seamless bridge between victims’ physical banking cards and fraudsters’ devices, enabling real-time financial theft…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T06:57:14Z",
      "last_seen": "2025-08-15T07:35:55Z"
    },
    {
      "id": "426fe114e06d2ff6ae99a0f024f2ae9f2bbe9a6f",
      "title": "Cisco Secure Firewall Vulnerability Allows Hackers to Inject Remote Shell Command Injection",
      "link": "https://cybersecuritynews.com/cisco-secure-firewall-vulnerability/",
      "date": "2025-08-15T03:59:41Z",
      "description": "Cisco has disclosed a critical security vulnerability in its Secure Firewall Management Center (FMC) Software that could allow unauthenticated attackers to execute arbitrary shell commands with high-level privileges remotely. The vulnerability, tracked as CVE-2025-20265 and assigned the maximum CVSS score of 10.0, represents one of the most severe security flaws discovered in enterprise firewall…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T04:54:53Z",
      "last_seen": "2025-08-15T07:35:55Z"
    },
    {
      "id": "cdf9ae1e8f11e42c9af8257f07967e40b7bef858",
      "title": "Threat Actors Personalize Phishing Attacks With Advanced Tactics for Malware Delivery",
      "link": "https://cybersecuritynews.com/threat-actors-personalize-phishing-attacks/",
      "date": "2025-08-15T02:19:08Z",
      "description": "Cybercriminals are increasingly leveraging personalization tactics to enhance the effectiveness of their malware-delivery phishing campaigns, with threat actors customizing subject lines, attachment names, and embedded links to create a false sense of authenticity and urgency. This sophisticated approach represents a significant evolution in social engineering techniques, as attackers craft…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T03:45:25Z",
      "last_seen": "2025-08-15T06:57:14Z"
    },
    {
      "id": "45d435518545100ab477817961a985f0c92ea61f",
      "title": "Patch Now: Apache Tomcat Fixes Session Fixation and ‘MadeYouReset’ Flaws",
      "link": "https://securityonline.info/patch-now-apache-tomcat-fixes-session-fixation-and-madeyoureset-flaws/",
      "date": "2025-08-15T00:17:09Z",
      "description": "The post Patch Now: Apache Tomcat Fixes Session Fixation and ‘MadeYouReset’ Flaws appeared first on Daily CyberSecurity.",
      "source": "securityonline.info",
      "first_seen": "2025-08-15T03:45:25Z",
      "last_seen": "2025-08-15T03:45:25Z"
    },
    {
      "id": "fa346f1ab9044f87027f972cd64a8f940bb37e84",
      "title": "Qilin Ransomware Leads The Attack Landscape With 70+ Claimed Victims in July",
      "link": "https://cybersecuritynews.com/qilin-ransomware-leads-the-attack-landscape/",
      "date": "2025-08-14T23:51:31Z",
      "description": "The ransomware threat landscape witnessed a concerning surge in July 2025, with the Qilin ransomware group maintaining its dominant position for the third time in four months. The group successfully claimed 73 victims on its data leak site, representing 17.3% of the month’s total 423 ransomware incidents. This marks a significant consolidation of criminal operations […] The post Qilin Ransomware…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T03:45:25Z",
      "last_seen": "2025-08-15T05:44:22Z"
    },
    {
      "id": "bf16b2a9f82d7912254af7892fecde42d02c400f",
      "title": "Google Chrome Enterprise: Advanced Browser Security for the Modern Workforce",
      "link": "https://www.darkreading.com/endpoint-security/google-chrome-enterprise-advanced-browser-security-modern-workforce",
      "date": "2025-08-14T20:12:20Z",
      "description": "In this Dark Reading News Desk interview, Google's Mark Berschadski highlights the critical role browsers play in today's work environment and how Chrome Enterprise is evolving to meet modern security challenges while enabling productivity.",
      "source": "darkreading.com",
      "first_seen": "2025-08-15T03:45:25Z",
      "last_seen": "2025-08-15T09:39:54Z"
    }
  ]
}