{
  "date": "2025-08-14",
  "count": 24,
  "items": [
    {
      "id": "800914a823eedaf64021408950e7c65ae63d28f3",
      "title": "Xerox FreeFlow Core Vulnerability Let Remote Attackers Execute Malicious Code – PoC Released",
      "link": "https://cybersecuritynews.com/xerox-freeflow-core-vulnerability/",
      "date": "2025-08-14T11:18:40Z",
      "description": "Critical vulnerabilities in Xerox FreeFlow Core, a widely-used print orchestration platform, allow unauthenticated remote attackers to execute malicious code on vulnerable systems. The flaws, tracked as CVE-2025-8355 and CVE-2025-8356, affect the JMF Client service and have been patched in FreeFlow Core version 8.0.5. Key Takeaways1. Two critical vulnerabilities in Xerox FreeFlow Core allow…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T11:32:55Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "0e339e4688ce686f3ee037b0adcf94075bd0a104",
      "title": "‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks",
      "link": "https://www.securityweek.com/madeyoureset-http2-vulnerability-enables-massive-ddos-attacks/",
      "date": "2025-08-14T11:11:46Z",
      "description": "The new DDoS attack vector, which involves HTTP/2 implementation flaws, has been compared to Rapid Reset. The post ‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-14T11:32:55Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "e0cee5c9ec92881bfb1f8bb344d0a1b3662873d7",
      "title": "Splunk Release Guide for Defenders to Detect Suspicious Activity Before ESXi Ransomware Attack",
      "link": "https://cybersecuritynews.com/esxi-ransomware-attack-guide/",
      "date": "2025-08-14T11:07:28Z",
      "description": "A detailed security guide released by Splunk to help cybersecurity teams detect and prevent ransomware attacks targeting ESXi infrastructure before they can cause catastrophic damage. The guide comes as a response to increasing threats against VMware’s ESXi hypervisor systems, which have become prime targets for cybercriminals due to their centralized nature and often inadequate monitoring. […]…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T11:32:55Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "a5c22dbebfe207bcb3371858f85f4a7052bf72b4",
      "title": "Leak: OpenAI's browser will use ChatGPT Agent to control the browser",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-openais-browser-will-use-chatgpt-agent-to-control-the-browser/",
      "date": "2025-08-14T10:45:32Z",
      "description": "OpenAI is building an agentic future with its upcoming Chromium-based browser and a new leak confirms GPT Agent integration. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T10:49:51Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "5c9faedfcba7ae9193ad4ea8e366b8fd7ec5c9c1",
      "title": "Simple Steps for Attack Surface Reduction",
      "link": "https://thehackernews.com/2025/08/simple-steps-for-attack-surface.html",
      "date": "2025-08-14T09:30:00Z",
      "description": "Story teaser text: Cybersecurity leaders face mounting pressure to stop attacks before they start, and the best defense may come down to the settings you choose on day one. In this piece, Yuriy Tsibere explores how default policies like deny-by-default, MFA enforcement, and application Ringfencing ™ can eliminate entire categories of risk. From disabling Office macros to blocking outbound server",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T10:49:51Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "7facbad3ef938aca23bd73b2ab4fe0d0590f7f2a",
      "title": "CISA warns of N-able N-central flaws exploited in zero-day attacks",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-n-able-n-central-flaws-exploited-in-zero-day-attacks/",
      "date": "2025-08-14T09:15:14Z",
      "description": "​CISA warned on Wednesday that attackers are actively exploiting two security vulnerabilities in N‑able's N-central remote monitoring and management (RMM) platform. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T09:46:19Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "60a5b6e9d76d1aaa5e00d1079eb26b76c74f355d",
      "title": "Passkey Login Bypassed via WebAuthn Process Manipulation",
      "link": "https://www.securityweek.com/passkey-login-bypassed-via-webauthn-process-manipulation/",
      "date": "2025-08-14T09:09:07Z",
      "description": "Researchers at enterprise browser security firm SquareX showed how an attacker can impersonate a user and bypass passkey security. The post Passkey Login Bypassed via WebAuthn Process Manipulation appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-14T09:46:19Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "e3b568944b8512b7ac2f3a4a31b55abe79f4863e",
      "title": "Critical WordPress Plugin Vulnerability Exposes 70,000+ Sites to RCE Attacks",
      "link": "https://cybersecuritynews.com/critical-wordpress-plugin-vulnerability-3/",
      "date": "2025-08-14T08:56:26Z",
      "description": "A critical security vulnerability has been discovered in the popular “Database for Contact Form 7, WPforms, Elementor forms” WordPress plugin, potentially exposing over 70,000 websites to remote code execution attacks. The vulnerability, tracked as CVE-2025-7384 with a maximum CVSS score of 9.8, affects all versions up to and including 1.4.3 and was publicly disclosed on […] The post Critical…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "638ff113997f024b35c6ba4b748d8c2e178096dd",
      "title": "CISA Warns of N-able N-Central Deserialization and Injection Vulnerability Exploited in Attacks",
      "link": "https://cybersecuritynews.com/cisa-warns-of-n-able-n-central-vulnerabilities/",
      "date": "2025-08-14T08:31:39Z",
      "description": "CISA has issued urgent warnings regarding two critical security vulnerabilities in N-able N-Central remote monitoring and management (RMM) software that threat actors are actively exploiting. The vulnerabilities, identified as CVE-2025-8875 and CVE-2025-8876, pose significant risks to organizations using this widely-deployed IT management platform. Key Takeaways1. Two critical N-able N-Central…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "d72e99984d17432ebf8f62cdaf0c0c5a90f7cfcd",
      "title": "ShinyHunters Possibly Collaborates With Scattered Spider in Salesforce Attack Campaigns",
      "link": "https://cybersecuritynews.com/shinyhunters-possibly-collaborates-with-scattered-spider/",
      "date": "2025-08-14T08:16:01Z",
      "description": "The notorious ShinyHunters cybercriminal group has emerged from a year-long hiatus with a sophisticated new wave of attacks targeting Salesforce platforms across major organizations, including high-profile victims like Google. This resurgence marks a significant tactical evolution for the financially motivated threat actors, who have traditionally focused on database exploitation and credential…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "f79777adda94fa231002719e62f653d4dcf69951",
      "title": "“AI-Induced Destruction” – New Attack Vector Where Helpful Tools Become Accidental Weapons",
      "link": "https://cybersecuritynews.com/ai-induced-destruction/",
      "date": "2025-08-14T07:50:04Z",
      "description": "Artificial intelligence coding assistants, designed to boost developer productivity, are inadvertently causing massive system destruction. Researchers report a significant spike in what they term “AI-induced destruction” incidents, where helpful AI tools become accidental weapons against the very systems they’re meant to improve. Key Takeaways1. AI assistants accidentally destroy systems when…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T10:49:51Z"
    },
    {
      "id": "69923730ca6b6cd17f29fea561f2c0c890dd0ad9",
      "title": "Microsoft fixes Windows 11 24H2 updates failing with 0x80240069 error",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-11-24h2-updates-failing-with-0x80240069-error/",
      "date": "2025-08-14T07:41:20Z",
      "description": "Microsoft has resolved a known issue preventing the August 2025 Windows 11 24H2 cumulative update from being delivered via Windows Server Update Services (WSUS). [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "da31b6afd59b8578398f08270b6cf20b602d3dda",
      "title": "Web DDoS, App Exploitation Attacks Saw a Huge Surge in First Half of 2025",
      "link": "https://cybersecuritynews.com/web-ddos-app-exploitation-attacks/",
      "date": "2025-08-14T07:35:17Z",
      "description": "The cybersecurity landscape experienced an unprecedented escalation in digital threats during the first half of 2025, with Web Distributed Denial of Service (DDoS) attacks surging by 39% compared to the second half of 2024. The second quarter alone witnessed a staggering 54% quarter-over-quarter spike in attack activity, marking the highest levels on record and signaling […] The post Web DDoS,…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T07:38:55Z",
      "last_seen": "2025-08-14T10:49:51Z"
    },
    {
      "id": "f76ab539ec2eb741d4d3f0c472914e637b1404e6",
      "title": "Google Requires Crypto App Licenses in 15 Regions as FBI Warns of $9.9M Scam Losses",
      "link": "https://thehackernews.com/2025/08/google-requires-crypto-app-licenses-in.html",
      "date": "2025-08-14T06:46:00Z",
      "description": "Google said it's implementing a new policy requiring developers of cryptocurrency exchanges and wallets to obtain government licenses before publishing apps in 15 jurisdictions in order to \"ensure a safe and compliant ecosystem for users.\" The policy applies to markets like Bahrain, Canada, Hong Kong, Indonesia, Israel, Japan, the Philippines, South Africa, South Korea, Switzerland, Thailand,",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "79bae2f8918e304e1d0ec898dccf8f7c26def5e0",
      "title": "What Is Out-of-Bounds Read and Write Vulnerability?",
      "link": "https://cybersecuritynews.com/out-of-bounds-read-and-write/",
      "date": "2025-08-14T06:39:36Z",
      "description": "Out-of-bounds read and write vulnerabilities represent critical security vulnerabilities that occur when software accesses memory locations beyond the allocated boundaries of data structures such as arrays, buffers, or other memory regions. These vulnerabilities can lead to information disclosure, system crashes, and in severe cases, arbitrary code execution that allows attackers to gain…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T06:58:28Z",
      "last_seen": "2025-08-14T07:38:55Z"
    },
    {
      "id": "478e8d511abc6bb8055536dd0d7993613ccd0b9a",
      "title": "VexTrio Hackers Attacking Users via Fake CAPTCHA Robots and Malicious Apps into Google Play and App Store",
      "link": "https://cybersecuritynews.com/vextrio-hackers-attacking-users-via-fake-captcha-robots/",
      "date": "2025-08-14T05:35:00Z",
      "description": "A sophisticated cybercriminal organization known as VexTrio has been orchestrating a massive fraud empire through deceptive CAPTCHA robots and malicious applications distributed across Google Play and the App Store. This criminal network, operating for over 15 years, has successfully infiltrated legitimate app stores with fraudulent software that has collectively garnered over one million…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T05:44:20Z",
      "last_seen": "2025-08-14T07:38:55Z"
    },
    {
      "id": "c02a01970e198841a0bab7bf902e24986ca09e62",
      "title": "Breaking Windows Out-of-Box-Experience to Gain Command Line Access With Admin Privileges",
      "link": "https://cybersecuritynews.com/breaking-windows-out-of-box-experience/",
      "date": "2025-08-14T05:32:28Z",
      "description": "A new method has been identified to exploit Windows Out-of-Box-Experience (OOBE) that bypasses existing protections and grants administrative command line access to Windows machines. This technique works even when Microsoft’s recommended security measure, the DisableCMDRequest.tag file, is implemented to block the well-known Shift + F10 keyboard shortcut vulnerability. The discovery highlights…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T05:44:20Z",
      "last_seen": "2025-08-14T07:38:55Z"
    },
    {
      "id": "9639215452a65a4342a7d7c47d554630d5948441",
      "title": "CISA Adds Two N-able N-central Flaws to Known Exploited Vulnerabilities Catalog",
      "link": "https://thehackernews.com/2025/08/cisa-adds-two-n-able-n-central-flaws-to.html",
      "date": "2025-08-14T04:02:00Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added two security flaws impacting N-able N-central to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation. N-able N-central is a Remote Monitoring and Management (RMM) platform designed for Managed Service Providers (MSPs), allowing customers to efficiently manage and secure",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T04:54:57Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "3074e466bf3d32bd001125110861307debc45e5f",
      "title": "Microsoft Exchange Server Vulnerabilities Let Attackers Spoof and Tamper Over Network",
      "link": "https://cybersecuritynews.com/microsoft-exchange-server-vulnerabilities/",
      "date": "2025-08-14T03:55:34Z",
      "description": "Critical security vulnerabilities in Microsoft Exchange Server enable attackers to perform spoofing and tampering attacks over network connections. The vulnerabilities include two Exchange Server flaws (CVE-2025-25007 and CVE-2025-25005) enabling spoofing and tampering attacks, plus a Windows Graphics Component elevation of privilege vulnerability (CVE-2025-49743) that could facilitate privilege…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T04:54:57Z",
      "last_seen": "2025-08-14T07:38:55Z"
    },
    {
      "id": "fde534c5fcd0ab81a5999b35aa0daeaed31e1db8",
      "title": "GitHub Copilot RCE Vulnerability via Prompt Injection Leads to Full System Compromise",
      "link": "https://cybersecuritynews.com/github-copilot-rce-vulnerability/",
      "date": "2025-08-14T02:18:54Z",
      "description": "A critical security vulnerability in GitHub Copilot and Visual Studio Code has been discovered that allows attackers to achieve remote code execution through prompt injection attacks, potentially leading to full system compromise of developers’ machines. The vulnerability, tracked as CVE-2025-53773, exploits GitHub Copilot’s ability to modify project configuration files, particularly the…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T06:58:28Z"
    },
    {
      "id": "3a5fe8a6b22f720d3210d468d9b6ea5b5c2d0637",
      "title": "Multiple GitLab Vulnerabilities Enables Account Takeover and Stored XSS Exploitation",
      "link": "https://cybersecuritynews.com/gitlab-vulnerabilities/",
      "date": "2025-08-14T01:46:50Z",
      "description": "GitLab has released emergency security patches addressing multiple critical vulnerabilities that could enable attackers to perform account takeovers and execute stored cross-site scripting (XSS) attacks. The patches were released on August 13, 2025, affecting GitLab Community Edition (CE) and Enterprise Edition (EE) across versions 18.2.2, 18.1.4, and 18.0.6. Key Takeaways1. GitLab patched three…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T05:44:20Z"
    },
    {
      "id": "17516d4d3876c6182f297bd1afcd250fdbf87f8e",
      "title": "Google Gemini's Deep Research is finally coming to API",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-geminis-deep-research-is-finally-coming-to-api/",
      "date": "2025-08-14T01:01:01Z",
      "description": "Google Gemini's one of the most powerful features is Deep Research, but up until now, it has been strictly limited to the Gemini interface. This could change soon. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "a2bc56117626b86b80784e907e7d0ebce6e1a326",
      "title": "North Korea Attacks South Koreans With Ransomware",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/north-korea-attacks-south-koreans-ransomware",
      "date": "2025-08-14T00:00:00Z",
      "description": "DPRK hackers are throwing every kind of malware at the wall and seeing what sticks, deploying stealers, backdoors, and ransomware all at once.",
      "source": "darkreading.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "27c8d910576451927462c27bb502459cecba4e25",
      "title": "Norwegian Police Say Pro-Russian Hackers Were Likely Behind Suspected Sabotage at a Dam",
      "link": "https://www.securityweek.com/norwegian-police-say-pro-russian-hackers-were-likely-behind-suspected-sabotage-at-a-dam/",
      "date": "2025-08-13T20:05:00Z",
      "description": "During the April incident, hackers gained access to a digital system which remotely controls one of the dam’s valves and opened it to increase the water flow. The post Norwegian Police Say Pro-Russian Hackers Were Likely Behind Suspected Sabotage at a Dam appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T11:32:55Z"
    }
  ]
}