{
  "date": "2025-08-14",
  "count": 59,
  "items": [
    {
      "id": "5d7e0df11824f119dfccd9a1215216aac23e8418",
      "title": "New FireWood Malware Attacking Linux Systems to Execute Commands and Exfiltrate Sensitive Data",
      "link": "https://cybersecuritynews.com/new-firewood-malware-attacking-linux-systems/",
      "date": "2025-08-14T22:42:04Z",
      "description": "A sophisticated new variant of the FireWood backdoor has emerged, targeting Linux systems with enhanced evasion capabilities and streamlined command execution functionality. This latest iteration represents a significant evolution of the malware family first discovered by ESET’s research team, which has been linked to the long-running “Project Wood” malware lineage dating back to at least […]…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T23:33:42Z",
      "last_seen": "2025-08-15T05:44:22Z"
    },
    {
      "id": "4274e4d465185c3b7101176e963c2f943594b309",
      "title": "New EncryptHub Campaign Leverages Brave Support Platform to Deliver Malicious Payloads via MMC Vulnerability",
      "link": "https://cybersecuritynews.com/new-encrypthub-campaign-leverages-brave-support-platform/",
      "date": "2025-08-14T22:13:54Z",
      "description": "The cyberthreat landscape continues to evolve as malicious actors develop increasingly sophisticated attack methods, with the EncryptHub threat group emerging as a particularly concerning adversary. This emerging threat actor, also known as LARVA-208 and Water Gamayun, has been making headlines for its aggressive campaigns targeting Web3 developers and abusing legitimate platforms to deliver…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T22:41:39Z",
      "last_seen": "2025-08-15T05:44:22Z"
    },
    {
      "id": "73f0204781430b056b4e9729a4363cdf3fe2797f",
      "title": "Downgrade Attack Allows Phishing Kits to Bypass FIDO",
      "link": "https://www.darkreading.com/cybersecurity-operations/downgrade-attack-phishing-kits-bypass-fido",
      "date": "2025-08-14T21:43:25Z",
      "description": "You probably can't break FIDO authentication. Still, researchers have shown that there are ways to get around it.",
      "source": "darkreading.com",
      "first_seen": "2025-08-14T22:41:39Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "5addde84b532ff52fa8fc7f7da446c6280e3fd0f",
      "title": "State and Local Leaders Lobby Congress for Cybersecurity Resources",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/state-local-leaders-lobby-congress-cybersecurity-resources",
      "date": "2025-08-14T21:26:01Z",
      "description": "Federal funding cuts to the Multi-State Information Sharing and Analysis Center (MS-ISAC) are about to leave more than 18,000 state and local organizations without access to basic cybersecurity resources they need to protect US national security, a letter sent to Congressional appropriators warns.",
      "source": "darkreading.com",
      "first_seen": "2025-08-14T21:35:22Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "faa30f9e7ac718b0213798819949e4c66b898188",
      "title": "Threat Actors Weaponizing YouTube Video Download Site to Download Proxyware Malware",
      "link": "https://cybersecuritynews.com/youtube-video-download-site-to-download-proxyware/",
      "date": "2025-08-14T20:24:51Z",
      "description": "Cybercriminals have escalated their proxyjacking campaigns by exploiting legitimate user behavior around YouTube video downloads, according to a recent security analysis. The attack leverages fake YouTube download sites to distribute proxyware malware, specifically targeting users seeking free video conversion services. This sophisticated campaign represents a significant evolution in bandwidth…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T20:41:50Z",
      "last_seen": "2025-08-15T03:45:25Z"
    },
    {
      "id": "06913e4d99d2f34b6889c2d168b68992970ee243",
      "title": "Over $300 million in cybercrime crypto seized in anti-fraud effort",
      "link": "https://www.bleepingcomputer.com/news/security/over-300-million-in-cybercrime-crypto-seized-in-anti-fraud-effort/",
      "date": "2025-08-14T20:15:34Z",
      "description": "More than $300 million worth of cryptocurrency linked to cybercrime and fraud schemes has been frozen due to two separate initiatives involving law enforcement and private companies. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T20:41:50Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "8b6672dfef7375b50263df9d4901a2fe5deab21e",
      "title": "Police &amp; Government Email Access for Sale on Dark Web",
      "link": "https://www.darkreading.com/threat-intelligence/government-email-sale-dark-web",
      "date": "2025-08-14T20:09:03Z",
      "description": "Cybercriminals are auctioning off live email credentials, giving other criminals access to sensitive systems, confidential intelligence, and, potentially, a higher success rate than ever.",
      "source": "darkreading.com",
      "first_seen": "2025-08-14T20:41:50Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "f51dc7959a1220f1aac2f90c91bcb9388941e4ca",
      "title": "New Trends in Phishing Attacks Emerges as AI Reshaping the Tool Used by Cybercriminals",
      "link": "https://cybersecuritynews.com/new-trends-in-phishing-attacks/",
      "date": "2025-08-14T19:31:44Z",
      "description": "The cybersecurity landscape is witnessing a fundamental transformation as artificial intelligence becomes the newest weapon in cybercriminals’ arsenals, revolutionizing traditional phishing and scam operations. Unlike conventional phishing campaigns that were often riddled with grammatical errors and obvious tells, modern AI-powered attacks present a sophisticated threat that challenges even the…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T20:41:50Z",
      "last_seen": "2025-08-14T23:33:42Z"
    },
    {
      "id": "35ddf63758918e6c438006f0b23ff2db817705fc",
      "title": "CISA Warns N-able Bugs Under Attack, Patch Now",
      "link": "https://www.darkreading.com/vulnerabilities-threats/n-able-bugs-under-attack",
      "date": "2025-08-14T18:58:41Z",
      "description": "Two critical N-able vulnerabilities enable local code execution and command injection; they require authentication to exploit, suggesting they wouldn't be seen at the beginning of an exploit chain.",
      "source": "darkreading.com",
      "first_seen": "2025-08-14T20:41:50Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "45bc63babc90f5342f1d3c99395d808ccd5b8356",
      "title": "Cybersecurity Spending Slows &amp; Security Teams Shrink",
      "link": "https://www.darkreading.com/cybersecurity-operations/cybersecurity-spending-slows-teams-shrink",
      "date": "2025-08-14T18:38:14Z",
      "description": "Security budgets are lowest in healthcare, professional and business services, retail, and hospitality, but budget growth remained above 5% in financial services, insurance, and tech.",
      "source": "darkreading.com",
      "first_seen": "2025-08-14T18:56:21Z",
      "last_seen": "2025-08-14T23:33:42Z"
    },
    {
      "id": "cfce48460b1837da1474def067223c8389912a0b",
      "title": "Crypto24 ransomware hits large orgs with custom EDR evasion tool",
      "link": "https://www.bleepingcomputer.com/news/security/crypto24-ransomware-hits-large-orgs-with-custom-edr-evasion-tool/",
      "date": "2025-08-14T17:53:58Z",
      "description": "The Crypto24 ransomware group has been using custom utilities to evade security solutions on breached networks, exfiltrate data, and encrypt files. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T18:56:21Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "b3be2e370dfaebe9d84ddf0046e5bf7d8ad698a3",
      "title": "Google Announces That Android’s pKVM Framework Achieves SESIP Level 5 Certification",
      "link": "https://cybersecuritynews.com/google-announces-that-androids-pkvm-framework/",
      "date": "2025-08-14T17:19:18Z",
      "description": "Google has achieved a significant milestone in mobile security with the announcement that Android’s protected KVM (pKVM) hypervisor has officially received SESIP Level 5 certification, marking it as the first software security system designed for large-scale consumer electronics deployment to reach this prestigious assurance level. This groundbreaking achievement positions Android at the…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T17:41:04Z",
      "last_seen": "2025-08-14T23:33:42Z"
    },
    {
      "id": "0cffc7686aeeb580f77da9c33bb73389f7c6c6d3",
      "title": "Pro-Russian hackers blamed for water dam sabotage in Norway",
      "link": "https://www.bleepingcomputer.com/news/security/pro-russian-hackers-blamed-for-water-dam-sabotage-in-norway/",
      "date": "2025-08-14T16:01:37Z",
      "description": "The Norwegian Police Security Service (PST) says that pro-Russian hackers took control of critical operation systems at a dam and opened outflow valves. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T16:52:05Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "0ed63e7511b32cda6283069be75a7cd1c9eea772",
      "title": "New HTTP/2 'MadeYouReset' Vulnerability Enables Large-Scale DoS Attacks",
      "link": "https://thehackernews.com/2025/08/new-http2-madeyoureset-vulnerability.html",
      "date": "2025-08-14T15:20:00Z",
      "description": "Multiple HTTP/2 implementations have been found susceptible to a new attack technique called MadeYouReset that could be explored to conduct powerful denial-of-service (DoS) attacks. \"MadeYouReset bypasses the typical server-imposed limit of 100 concurrent HTTP/2 requests per TCP connection from a client. This limit is intended to mitigate DoS attacks by restricting the number of simultaneous",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T16:52:05Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "22cb3ad967226e04f6719cab6e5d7e2848f986e0",
      "title": "Microsoft fixes Windows Server bug causing cluster, VM issues",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-server-bug-causing-cluster-vm-issues/",
      "date": "2025-08-14T15:05:10Z",
      "description": "Microsoft has resolved a known issue that triggers Cluster service and VM restart issues after installing July's Windows Server 2019 security updates. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T16:52:05Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "cb35c64a2f2010f1af1347d8ee1d84610c834b3a",
      "title": "Canada’s House of Commons Hit by Cyberattack Exploiting Recent Microsoft vulnerability",
      "link": "https://cybersecuritynews.com/canadas-house-of-commons-cyberattack/",
      "date": "2025-08-14T14:59:40Z",
      "description": "A cyberattack hit the Canadian House of Commons on August 9, 2025, when threat actors exploited a recently disclosed Microsoft vulnerability to gain unauthorized access to sensitive employee information. The breach underscores the growing cybersecurity challenges facing Canada’s government institutions amid an escalating threat landscape. According to an internal email obtained by CBC News,…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T15:43:40Z",
      "last_seen": "2025-08-14T22:41:39Z"
    },
    {
      "id": "2b79bed1523fd4b17041a372c677a9fa09288f31",
      "title": "Booking.com phishing campaign uses sneaky 'ん' character to trick you",
      "link": "https://www.bleepingcomputer.com/news/security/bookingcom-phishing-campaign-uses-sneaky-character-to-trick-you/",
      "date": "2025-08-14T14:23:45Z",
      "description": "Threat actors are leveraging a Unicode character to make phishing links appear like legitimate Booking.com links in a new campaign distributing malware. The attack makes use of the Japanese hiragana character, ん, which can, on some systems, appear as a forward slash and make a phishing URL appear realistic to a person at first. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T14:47:59Z",
      "last_seen": "2025-08-15T07:35:55Z"
    },
    {
      "id": "e016a74a2ef53d32df0a983211a7afca63f78e46",
      "title": "When Theft Replaces Encryption: Blue Report 2025 on Ransomware & Infostealers",
      "link": "https://www.bleepingcomputer.com/news/security/when-theft-replaces-encryption-blue-report-2025-on-ransomware-and-infostealers/",
      "date": "2025-08-14T14:01:11Z",
      "description": "Ransomware and infostealers are winning on stealth, not encryption. Picus Blue Report 2025 reveals just 3% of data exfiltration attempts are stopped. Find and fix your biggest exposure gaps before they're exploited. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T14:47:59Z",
      "last_seen": "2025-08-14T19:26:51Z"
    },
    {
      "id": "d30c976c2176bbd9d5f892e9944b003928012031",
      "title": "Navigating the Cybersecurity Budget Tug-of-War",
      "link": "https://www.darkreading.com/cybersecurity-operations/navigating-cybersecurity-budget-tug-of-war",
      "date": "2025-08-14T14:00:00Z",
      "description": "Companies ready to move beyond reactive defense and toward full-spectrum protection need to invest in strategies that rally around resiliency, unified cybersecurity, and data protection.",
      "source": "darkreading.com",
      "first_seen": "2025-08-14T15:43:40Z",
      "last_seen": "2025-08-14T21:35:22Z"
    },
    {
      "id": "0a5731492a6bdbe2d169d9bf616785d580c169b9",
      "title": "Vulnerabilities in Xerox Print Orchestration Product Allow Remote Code Execution",
      "link": "https://www.securityweek.com/vulnerabilities-in-xerox-print-orchestration-product-allow-remote-code-execution/",
      "date": "2025-08-14T13:47:57Z",
      "description": "Path traversal and XXE injection flaws allowing unauthenticated remote code execution have been patched in Xerox FreeFlow Core. The post Vulnerabilities in Xerox Print Orchestration Product Allow Remote Code Execution appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-14T13:50:45Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "c5ce84e4a02caa6ef5ff16b3800cb58e6ea1b6c4",
      "title": "Apache Tomcat Vulnerabilities Let Attackers Trigger Dos Attack",
      "link": "https://cybersecuritynews.com/apache-tomcat-dos-vulnerabilities-2/",
      "date": "2025-08-14T13:45:48Z",
      "description": "A critical security vulnerability in Apache Tomcat’s HTTP/2 implementation has been discovered, enabling attackers to launch devastating denial-of-service (DoS) attacks against web servers. The vulnerability, designated as CVE-2025-48989 and dubbed the “Made You Reset” attack, affects multiple versions of the popular Java servlet container and poses significant risks to web applications…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T13:50:45Z",
      "last_seen": "2025-08-14T21:35:22Z"
    },
    {
      "id": "f895f9a073ab31d47cf7bc2730e9a42541d0887b",
      "title": "Adobe’s August 2025 Patch Tuesday – 60 Vulnerabilities Patches Across Multiple Products",
      "link": "https://cybersecuritynews.com/adobe-vulnerabilities-patches-across-multiple-products/",
      "date": "2025-08-14T13:28:10Z",
      "description": "Adobe has released a comprehensive security update addressing 60 critical vulnerabilities across 13 of its flagship products as part of its August 2025 Patch Tuesday initiative. The massive security bulletin, published on August 12, 2025, represents one of the most significant coordinated vulnerability disclosure events in Adobe’s recent history, affecting everything from Creative Cloud…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T13:50:45Z",
      "last_seen": "2025-08-14T19:26:51Z"
    },
    {
      "id": "053ac76fab5f82c44d8544fd17b7f333a47ca82f",
      "title": "Hackers Found Using CrossC2 to Expand Cobalt Strike Beacon’s Reach to Linux and macOS",
      "link": "https://thehackernews.com/2025/08/researchers-warn-crossc2-expands-cobalt.html",
      "date": "2025-08-14T13:16:00Z",
      "description": "Japan's CERT coordination center (JPCERT/CC) on Thursday revealed it observed incidents that involved the use of a command-and-control (C2) framework called CrossC2, which is designed to extend the functionality of Cobalt Strike to other platforms like Linux and Apple macOS for cross-platform system control. The agency said the activity was detected between September and December 2024, targeting",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T14:47:59Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "93065346dca2d911c955e206a131f0825f71a714",
      "title": "Canada’s House of Commons investigating data breach after cyberattack",
      "link": "https://www.bleepingcomputer.com/news/security/canadas-house-of-commons-investigating-data-breach-after-cyberattack/",
      "date": "2025-08-14T13:06:43Z",
      "description": "The House of Commons of Canada is currently investigating a data breach after a threat actor reportedly stole employee information in a cyberattack on Friday. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T13:50:45Z",
      "last_seen": "2025-08-14T17:41:04Z"
    },
    {
      "id": "e16cc0659e7bedf7d87b071a50f514988b011888",
      "title": "How ShinyHunters Breached Google, Adidas, Louis Vuitton and More in Ongoing Salesforce Attack Campaign",
      "link": "https://cybersecuritynews.com/shinyhunters-breaches/",
      "date": "2025-08-14T13:06:39Z",
      "description": "The cybersecurity landscape witnessed a sophisticated and ongoing attack campaign throughout 2025 that has successfully compromised major corporations, including Google, Adidas, Louis Vuitton, and numerous other high-profile organizations. This comprehensive technical analysis reveals how the notorious cybercriminal group ShinyHunters, in apparent collaboration with Scattered Spider, has…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T13:50:45Z",
      "last_seen": "2025-08-14T19:26:51Z"
    },
    {
      "id": "48e6fe05f860110b2d5f9c1f23edf0dd381fe9b3",
      "title": "SmartLoader Malware via Github Repository as Legitimate Projects Infection Users Computer",
      "link": "https://cybersecuritynews.com/smartloader-malware-via-github-repository/",
      "date": "2025-08-14T13:05:04Z",
      "description": "Cybersecurity researchers have uncovered a sophisticated malware distribution campaign utilizing GitHub repositories disguised as legitimate software projects. The SmartLoader malware has been strategically deployed across multiple repositories, capitalizing on users’ trust in the popular code-sharing platform to infiltrate systems worldwide. The malicious campaign targets users searching for…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T13:50:45Z",
      "last_seen": "2025-08-14T16:52:05Z"
    },
    {
      "id": "8049e44e338ce0fe10737946e9110dd03a999c80",
      "title": "CISA Warns of Attacks Exploiting N-able Vulnerabilities",
      "link": "https://www.securityweek.com/cisa-warns-of-attacks-exploiting-n-able-vulnerabilities/",
      "date": "2025-08-14T12:29:38Z",
      "description": "CISA reported becoming aware of attacks exploiting CVE-2025-8875 and CVE-2025-8876 in N-able N-central on the day they were patched. The post CISA Warns of Attacks Exploiting N-able Vulnerabilities appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-14T13:50:45Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "e293abdb6d393baa280e884872593e4634d87c8d",
      "title": "Hackers Using Dedicated Phishlet to Launch FIDO Authentication Downgrade Attacks",
      "link": "https://cybersecuritynews.com/hackers-using-dedicated-phishlet/",
      "date": "2025-08-14T11:40:32Z",
      "description": "A sophisticated new threat vector has emerged that could undermine one of the most trusted authentication methods in cybersecurity. FIDO-based passkeys, long considered the gold standard for phishing-resistant authentication, are now facing a potentially devastating attack technique that forces users to downgrade to less secure authentication methods. The attack exploits a critical vulnerability…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T13:50:45Z",
      "last_seen": "2025-08-14T14:47:59Z"
    },
    {
      "id": "0195b44176648526ad9326ecceeee7d91954b531",
      "title": "Have You Turned Off Your Virtual Oven?",
      "link": "https://thehackernews.com/2025/08/have-you-turned-off-your-virtual-oven.html",
      "date": "2025-08-14T11:25:00Z",
      "description": "You check that the windows are shut before leaving home. Return to the kitchen to verify that the oven and stove were definitely turned off. Maybe even circle back again to confirm the front door was properly closed. These automatic safety checks give you peace of mind because you know the unlikely but potentially dangerous consequences of forgetting – a break-in, fire, or worse. Your",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T13:50:45Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "800914a823eedaf64021408950e7c65ae63d28f3",
      "title": "Xerox FreeFlow Core Vulnerability Let Remote Attackers Execute Malicious Code – PoC Released",
      "link": "https://cybersecuritynews.com/xerox-freeflow-core-vulnerability/",
      "date": "2025-08-14T11:18:40Z",
      "description": "Critical vulnerabilities in Xerox FreeFlow Core, a widely-used print orchestration platform, allow unauthenticated remote attackers to execute malicious code on vulnerable systems. The flaws, tracked as CVE-2025-8355 and CVE-2025-8356, affect the JMF Client service and have been patched in FreeFlow Core version 8.0.5. Key Takeaways1. Two critical vulnerabilities in Xerox FreeFlow Core allow…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T11:32:55Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "0e339e4688ce686f3ee037b0adcf94075bd0a104",
      "title": "‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks",
      "link": "https://www.securityweek.com/madeyoureset-http2-vulnerability-enables-massive-ddos-attacks/",
      "date": "2025-08-14T11:11:46Z",
      "description": "The new DDoS attack vector, which involves HTTP/2 implementation flaws, has been compared to Rapid Reset. The post ‘MadeYouReset’ HTTP2 Vulnerability Enables Massive DDoS Attacks appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-14T11:32:55Z",
      "last_seen": "2025-08-15T09:39:54Z"
    },
    {
      "id": "e0cee5c9ec92881bfb1f8bb344d0a1b3662873d7",
      "title": "Splunk Release Guide for Defenders to Detect Suspicious Activity Before ESXi Ransomware Attack",
      "link": "https://cybersecuritynews.com/esxi-ransomware-attack-guide/",
      "date": "2025-08-14T11:07:28Z",
      "description": "A detailed security guide released by Splunk to help cybersecurity teams detect and prevent ransomware attacks targeting ESXi infrastructure before they can cause catastrophic damage. The guide comes as a response to increasing threats against VMware’s ESXi hypervisor systems, which have become prime targets for cybercriminals due to their centralized nature and often inadequate monitoring. […]…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T11:32:55Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "de81530e8e2706dcad5c7e1f7a252efd3931a974",
      "title": "New Android Malware Wave Hits Banking via NFC Relay Fraud, Call Hijacking, and Root Exploits",
      "link": "https://thehackernews.com/2025/08/new-android-malware-wave-hits-banking.html",
      "date": "2025-08-14T11:06:00Z",
      "description": "Cybersecurity researchers have disclosed a new Android trojan called PhantomCard that abuses near-field communication (NFC) to conduct relay attacks for facilitating fraudulent transactions in attacks targeting banking customers in Brazil. \"PhantomCard relays NFC data from a victim's banking card to the fraudster's device,\" ThreatFabric said in a report. \"PhantomCard is based on",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T13:50:45Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "a5c22dbebfe207bcb3371858f85f4a7052bf72b4",
      "title": "Leak: OpenAI's browser will use ChatGPT Agent to control the browser",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/leak-openais-browser-will-use-chatgpt-agent-to-control-the-browser/",
      "date": "2025-08-14T10:45:32Z",
      "description": "OpenAI is building an agentic future with its upcoming Chromium-based browser and a new leak confirms GPT Agent integration. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T10:49:51Z",
      "last_seen": "2025-08-14T15:43:40Z"
    },
    {
      "id": "5c9faedfcba7ae9193ad4ea8e366b8fd7ec5c9c1",
      "title": "Simple Steps for Attack Surface Reduction",
      "link": "https://thehackernews.com/2025/08/simple-steps-for-attack-surface.html",
      "date": "2025-08-14T09:30:00Z",
      "description": "Story teaser text: Cybersecurity leaders face mounting pressure to stop attacks before they start, and the best defense may come down to the settings you choose on day one. In this piece, Yuriy Tsibere explores how default policies like deny-by-default, MFA enforcement, and application Ringfencing ™ can eliminate entire categories of risk. From disabling Office macros to blocking outbound server",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T10:49:51Z",
      "last_seen": "2025-08-15T07:35:55Z"
    },
    {
      "id": "7facbad3ef938aca23bd73b2ab4fe0d0590f7f2a",
      "title": "CISA warns of N-able N-central flaws exploited in zero-day attacks",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-n-able-n-central-flaws-exploited-in-zero-day-attacks/",
      "date": "2025-08-14T09:15:14Z",
      "description": "​CISA warned on Wednesday that attackers are actively exploiting two security vulnerabilities in N‑able's N-central remote monitoring and management (RMM) platform. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T09:46:19Z",
      "last_seen": "2025-08-14T15:43:40Z"
    },
    {
      "id": "60a5b6e9d76d1aaa5e00d1079eb26b76c74f355d",
      "title": "Passkey Login Bypassed via WebAuthn Process Manipulation",
      "link": "https://www.securityweek.com/passkey-login-bypassed-via-webauthn-process-manipulation/",
      "date": "2025-08-14T09:09:07Z",
      "description": "Researchers at enterprise browser security firm SquareX showed how an attacker can impersonate a user and bypass passkey security. The post Passkey Login Bypassed via WebAuthn Process Manipulation appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-14T09:46:19Z",
      "last_seen": "2025-08-15T07:35:55Z"
    },
    {
      "id": "e3b568944b8512b7ac2f3a4a31b55abe79f4863e",
      "title": "Critical WordPress Plugin Vulnerability Exposes 70,000+ Sites to RCE Attacks",
      "link": "https://cybersecuritynews.com/critical-wordpress-plugin-vulnerability-3/",
      "date": "2025-08-14T08:56:26Z",
      "description": "A critical security vulnerability has been discovered in the popular “Database for Contact Form 7, WPforms, Elementor forms” WordPress plugin, potentially exposing over 70,000 websites to remote code execution attacks. The vulnerability, tracked as CVE-2025-7384 with a maximum CVSS score of 9.8, affects all versions up to and including 1.4.3 and was publicly disclosed on […] The post Critical…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "638ff113997f024b35c6ba4b748d8c2e178096dd",
      "title": "CISA Warns of N-able N-Central Deserialization and Injection Vulnerability Exploited in Attacks",
      "link": "https://cybersecuritynews.com/cisa-warns-of-n-able-n-central-vulnerabilities/",
      "date": "2025-08-14T08:31:39Z",
      "description": "CISA has issued urgent warnings regarding two critical security vulnerabilities in N-able N-Central remote monitoring and management (RMM) software that threat actors are actively exploiting. The vulnerabilities, identified as CVE-2025-8875 and CVE-2025-8876, pose significant risks to organizations using this widely-deployed IT management platform. Key Takeaways1. Two critical N-able N-Central…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "d72e99984d17432ebf8f62cdaf0c0c5a90f7cfcd",
      "title": "ShinyHunters Possibly Collaborates With Scattered Spider in Salesforce Attack Campaigns",
      "link": "https://cybersecuritynews.com/shinyhunters-possibly-collaborates-with-scattered-spider/",
      "date": "2025-08-14T08:16:01Z",
      "description": "The notorious ShinyHunters cybercriminal group has emerged from a year-long hiatus with a sophisticated new wave of attacks targeting Salesforce platforms across major organizations, including high-profile victims like Google. This resurgence marks a significant tactical evolution for the financially motivated threat actors, who have traditionally focused on database exploitation and credential…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T11:32:55Z"
    },
    {
      "id": "f79777adda94fa231002719e62f653d4dcf69951",
      "title": "“AI-Induced Destruction” – New Attack Vector Where Helpful Tools Become Accidental Weapons",
      "link": "https://cybersecuritynews.com/ai-induced-destruction/",
      "date": "2025-08-14T07:50:04Z",
      "description": "Artificial intelligence coding assistants, designed to boost developer productivity, are inadvertently causing massive system destruction. Researchers report a significant spike in what they term “AI-induced destruction” incidents, where helpful AI tools become accidental weapons against the very systems they’re meant to improve. Key Takeaways1. AI assistants accidentally destroy systems when…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T10:49:51Z"
    },
    {
      "id": "69923730ca6b6cd17f29fea561f2c0c890dd0ad9",
      "title": "Microsoft fixes Windows 11 24H2 updates failing with 0x80240069 error",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-11-24h2-updates-failing-with-0x80240069-error/",
      "date": "2025-08-14T07:41:20Z",
      "description": "Microsoft has resolved a known issue preventing the August 2025 Windows 11 24H2 cumulative update from being delivered via Windows Server Update Services (WSUS). [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T13:50:45Z"
    },
    {
      "id": "da31b6afd59b8578398f08270b6cf20b602d3dda",
      "title": "Web DDoS, App Exploitation Attacks Saw a Huge Surge in First Half of 2025",
      "link": "https://cybersecuritynews.com/web-ddos-app-exploitation-attacks/",
      "date": "2025-08-14T07:35:17Z",
      "description": "The cybersecurity landscape experienced an unprecedented escalation in digital threats during the first half of 2025, with Web Distributed Denial of Service (DDoS) attacks surging by 39% compared to the second half of 2024. The second quarter alone witnessed a staggering 54% quarter-over-quarter spike in attack activity, marking the highest levels on record and signaling […] The post Web DDoS,…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T07:38:55Z",
      "last_seen": "2025-08-14T10:49:51Z"
    },
    {
      "id": "f76ab539ec2eb741d4d3f0c472914e637b1404e6",
      "title": "Google Requires Crypto App Licenses in 15 Regions as FBI Warns of $9.9M Scam Losses",
      "link": "https://thehackernews.com/2025/08/google-requires-crypto-app-licenses-in.html",
      "date": "2025-08-14T06:46:00Z",
      "description": "Google said it's implementing a new policy requiring developers of cryptocurrency exchanges and wallets to obtain government licenses before publishing apps in 15 jurisdictions in order to \"ensure a safe and compliant ecosystem for users.\" The policy applies to markets like Bahrain, Canada, Hong Kong, Indonesia, Israel, Japan, the Philippines, South Africa, South Korea, Switzerland, Thailand,",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T08:56:32Z",
      "last_seen": "2025-08-14T15:43:40Z"
    },
    {
      "id": "79bae2f8918e304e1d0ec898dccf8f7c26def5e0",
      "title": "What Is Out-of-Bounds Read and Write Vulnerability?",
      "link": "https://cybersecuritynews.com/out-of-bounds-read-and-write/",
      "date": "2025-08-14T06:39:36Z",
      "description": "Out-of-bounds read and write vulnerabilities represent critical security vulnerabilities that occur when software accesses memory locations beyond the allocated boundaries of data structures such as arrays, buffers, or other memory regions. These vulnerabilities can lead to information disclosure, system crashes, and in severe cases, arbitrary code execution that allows attackers to gain…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T06:58:28Z",
      "last_seen": "2025-08-14T07:38:55Z"
    },
    {
      "id": "478e8d511abc6bb8055536dd0d7993613ccd0b9a",
      "title": "VexTrio Hackers Attacking Users via Fake CAPTCHA Robots and Malicious Apps into Google Play and App Store",
      "link": "https://cybersecuritynews.com/vextrio-hackers-attacking-users-via-fake-captcha-robots/",
      "date": "2025-08-14T05:35:00Z",
      "description": "A sophisticated cybercriminal organization known as VexTrio has been orchestrating a massive fraud empire through deceptive CAPTCHA robots and malicious applications distributed across Google Play and the App Store. This criminal network, operating for over 15 years, has successfully infiltrated legitimate app stores with fraudulent software that has collectively garnered over one million…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T05:44:20Z",
      "last_seen": "2025-08-14T07:38:55Z"
    },
    {
      "id": "c02a01970e198841a0bab7bf902e24986ca09e62",
      "title": "Breaking Windows Out-of-Box-Experience to Gain Command Line Access With Admin Privileges",
      "link": "https://cybersecuritynews.com/breaking-windows-out-of-box-experience/",
      "date": "2025-08-14T05:32:28Z",
      "description": "A new method has been identified to exploit Windows Out-of-Box-Experience (OOBE) that bypasses existing protections and grants administrative command line access to Windows machines. This technique works even when Microsoft’s recommended security measure, the DisableCMDRequest.tag file, is implemented to block the well-known Shift + F10 keyboard shortcut vulnerability. The discovery highlights…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T05:44:20Z",
      "last_seen": "2025-08-14T07:38:55Z"
    },
    {
      "id": "e4efef277cc2d5dcbe757c7347cf536cf4c0f142",
      "title": "ZDI-CAN-27786: Katana Network",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 9.8 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Peter Girnus (@gothburz) of Trend Research' was reported to the affected vendor on: 2025-08-14, 0 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com",
      "first_seen": "2025-08-14T14:47:59Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "bc642790b191a01c5a883cbb2e6577e9ecc0c97d",
      "title": "ZDI-CAN-22274: Hexo",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 3.7 AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:N/A:N severity vulnerability discovered by 'Grigory Dorodnov of Trend Micro Security Research' was reported to the affected vendor on: 2025-08-14, 0 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com",
      "first_seen": "2025-08-14T14:47:59Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "e1105d4d615c2d0e96048013fe60472722d8e4a3",
      "title": "ZDI-CAN-27784: github-kanban-mcp-server",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 9.8 AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Brandon Niemczyk & Peter Girnus (@gothburz) of Trend Zero Day Initiative' was reported to the affected vendor on: 2025-08-14, 0 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com",
      "first_seen": "2025-08-14T14:47:59Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "a4498d51cd265653ea6769be59040bf6f5e78538",
      "title": "ZDI-CAN-26620: Hancom",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 7.8 AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H severity vulnerability discovered by 'rgod' was reported to the affected vendor on: 2025-08-14, 0 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com",
      "first_seen": "2025-08-14T15:43:40Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "33d2d075dcc0c0c0b98144eb1ff8b25be5c2d0fc",
      "title": "ZDI-CAN-27894: Apple",
      "link": "http://www.zerodayinitiative.com/advisories/upcoming/",
      "date": "2025-08-14T05:00:00Z",
      "description": "A CVSS score 7.8 AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H severity vulnerability discovered by 'Nikolai Skliarenko of Trend Micro Security Research' was reported to the affected vendor on: 2025-08-14, 0 days ago. The vendor is given until 2025-12-12 to publish a fix or workaround. Once the vendor has created and tested a patch we will coordinate the release of a public advisory.",
      "source": "zerodayinitiative.com",
      "first_seen": "2025-08-14T19:26:51Z",
      "last_seen": "2025-08-15T11:30:24Z"
    },
    {
      "id": "9639215452a65a4342a7d7c47d554630d5948441",
      "title": "CISA Adds Two N-able N-central Flaws to Known Exploited Vulnerabilities Catalog",
      "link": "https://thehackernews.com/2025/08/cisa-adds-two-n-able-n-central-flaws-to.html",
      "date": "2025-08-14T04:02:00Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added two security flaws impacting N-able N-central to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation. N-able N-central is a Remote Monitoring and Management (RMM) platform designed for Managed Service Providers (MSPs), allowing customers to efficiently manage and secure",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T04:54:57Z",
      "last_seen": "2025-08-14T13:50:45Z"
    },
    {
      "id": "3074e466bf3d32bd001125110861307debc45e5f",
      "title": "Microsoft Exchange Server Vulnerabilities Let Attackers Spoof and Tamper Over Network",
      "link": "https://cybersecuritynews.com/microsoft-exchange-server-vulnerabilities/",
      "date": "2025-08-14T03:55:34Z",
      "description": "Critical security vulnerabilities in Microsoft Exchange Server enable attackers to perform spoofing and tampering attacks over network connections. The vulnerabilities include two Exchange Server flaws (CVE-2025-25007 and CVE-2025-25005) enabling spoofing and tampering attacks, plus a Windows Graphics Component elevation of privilege vulnerability (CVE-2025-49743) that could facilitate privilege…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T04:54:57Z",
      "last_seen": "2025-08-14T07:38:55Z"
    },
    {
      "id": "fde534c5fcd0ab81a5999b35aa0daeaed31e1db8",
      "title": "GitHub Copilot RCE Vulnerability via Prompt Injection Leads to Full System Compromise",
      "link": "https://cybersecuritynews.com/github-copilot-rce-vulnerability/",
      "date": "2025-08-14T02:18:54Z",
      "description": "A critical security vulnerability in GitHub Copilot and Visual Studio Code has been discovered that allows attackers to achieve remote code execution through prompt injection attacks, potentially leading to full system compromise of developers’ machines. The vulnerability, tracked as CVE-2025-53773, exploits GitHub Copilot’s ability to modify project configuration files, particularly the…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T06:58:28Z"
    },
    {
      "id": "3a5fe8a6b22f720d3210d468d9b6ea5b5c2d0637",
      "title": "Multiple GitLab Vulnerabilities Enables Account Takeover and Stored XSS Exploitation",
      "link": "https://cybersecuritynews.com/gitlab-vulnerabilities/",
      "date": "2025-08-14T01:46:50Z",
      "description": "GitLab has released emergency security patches addressing multiple critical vulnerabilities that could enable attackers to perform account takeovers and execute stored cross-site scripting (XSS) attacks. The patches were released on August 13, 2025, affecting GitLab Community Edition (CE) and Enterprise Edition (EE) across versions 18.2.2, 18.1.4, and 18.0.6. Key Takeaways1. GitLab patched three…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T05:44:20Z"
    },
    {
      "id": "17516d4d3876c6182f297bd1afcd250fdbf87f8e",
      "title": "Google Gemini's Deep Research is finally coming to API",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-geminis-deep-research-is-finally-coming-to-api/",
      "date": "2025-08-14T01:01:01Z",
      "description": "Google Gemini's one of the most powerful features is Deep Research, but up until now, it has been strictly limited to the Gemini interface. This could change soon. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T13:50:45Z"
    },
    {
      "id": "a2bc56117626b86b80784e907e7d0ebce6e1a326",
      "title": "North Korea Attacks South Koreans With Ransomware",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/north-korea-attacks-south-koreans-ransomware",
      "date": "2025-08-14T00:00:00Z",
      "description": "DPRK hackers are throwing every kind of malware at the wall and seeing what sticks, deploying stealers, backdoors, and ransomware all at once.",
      "source": "darkreading.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T20:41:50Z"
    },
    {
      "id": "27c8d910576451927462c27bb502459cecba4e25",
      "title": "Norwegian Police Say Pro-Russian Hackers Were Likely Behind Suspected Sabotage at a Dam",
      "link": "https://www.securityweek.com/norwegian-police-say-pro-russian-hackers-were-likely-behind-suspected-sabotage-at-a-dam/",
      "date": "2025-08-13T20:05:00Z",
      "description": "During the April incident, hackers gained access to a digital system which remotely controls one of the dam’s valves and opened it to increase the water flow. The post Norwegian Police Say Pro-Russian Hackers Were Likely Behind Suspected Sabotage at a Dam appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-15T07:35:55Z"
    }
  ]
}