{
  "date": "2025-08-15",
  "count": 8,
  "items": [
    {
      "id": "e9f11ab5b10454d897d0192f99d4b930a6af21eb",
      "title": "Threat Actors Attacking Windows Systems With New Multi-Stage Malware Framework PS1Bot",
      "link": "https://cybersecuritynews.com/new-multi-stage-malware-framework-ps1bot/",
      "date": "2025-08-15T06:46:40Z",
      "description": "A sophisticated new malware campaign targeting Windows systems has emerged, employing a multi-stage framework dubbed “PS1Bot” that combines PowerShell and C# components to conduct extensive information theft operations. The malware represents a significant evolution in attack methodologies, utilizing modular architecture and in-memory execution techniques to evade traditional detection…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T06:57:14Z",
      "last_seen": "2025-08-15T06:57:14Z"
    },
    {
      "id": "e876378f3412c34d6a124c18f5c4165f8a4e77b8",
      "title": "New HTTP/2 MadeYouReset Vulnerability Enables Large-Scale DDoS Attacks",
      "link": "https://cybersecuritynews.com/http-2-madeyoureset-vulnerability/",
      "date": "2025-08-15T06:12:42Z",
      "description": "Security researchers have identified a new denial-of-service (DoS) vulnerability in HTTP/2 implementations, referred to as MadeYouReset (CVE-2025-8671). This discovery represents a notable escalation in the threats associated with web protocols. Publicly disclosed on August 13, 2025, this flaw allows attackers to bypass built-in concurrency limits, overwhelming servers with unbounded concurrent…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T06:57:14Z",
      "last_seen": "2025-08-15T06:57:14Z"
    },
    {
      "id": "9275f8e6eb22a5da9eceee9e5c53f7b701a0b232",
      "title": "New NFC-Driven PhantomCard Android Malware Attacking Banking Users",
      "link": "https://cybersecuritynews.com/new-nfc-driven-phantomcard-android-malware/",
      "date": "2025-08-15T06:04:25Z",
      "description": "A sophisticated new Android malware dubbed PhantomCard has emerged from the shadows of Brazil’s cybercriminal underground, representing a significant evolution in mobile banking threats. This malicious application leverages Near Field Communication (NFC) technology to create a seamless bridge between victims’ physical banking cards and fraudsters’ devices, enabling real-time financial theft…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T06:57:14Z",
      "last_seen": "2025-08-15T06:57:14Z"
    },
    {
      "id": "426fe114e06d2ff6ae99a0f024f2ae9f2bbe9a6f",
      "title": "Cisco Secure Firewall Vulnerability Allows Hackers to Inject Remote Shell Command Injection",
      "link": "https://cybersecuritynews.com/cisco-secure-firewall-vulnerability/",
      "date": "2025-08-15T03:59:41Z",
      "description": "Cisco has disclosed a critical security vulnerability in its Secure Firewall Management Center (FMC) Software that could allow unauthenticated attackers to execute arbitrary shell commands with high-level privileges remotely. The vulnerability, tracked as CVE-2025-20265 and assigned the maximum CVSS score of 10.0, represents one of the most severe security flaws discovered in enterprise firewall…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T04:54:53Z",
      "last_seen": "2025-08-15T06:57:14Z"
    },
    {
      "id": "cdf9ae1e8f11e42c9af8257f07967e40b7bef858",
      "title": "Threat Actors Personalize Phishing Attacks With Advanced Tactics for Malware Delivery",
      "link": "https://cybersecuritynews.com/threat-actors-personalize-phishing-attacks/",
      "date": "2025-08-15T02:19:08Z",
      "description": "Cybercriminals are increasingly leveraging personalization tactics to enhance the effectiveness of their malware-delivery phishing campaigns, with threat actors customizing subject lines, attachment names, and embedded links to create a false sense of authenticity and urgency. This sophisticated approach represents a significant evolution in social engineering techniques, as attackers craft…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T03:45:25Z",
      "last_seen": "2025-08-15T06:57:14Z"
    },
    {
      "id": "45d435518545100ab477817961a985f0c92ea61f",
      "title": "Patch Now: Apache Tomcat Fixes Session Fixation and ‘MadeYouReset’ Flaws",
      "link": "https://securityonline.info/patch-now-apache-tomcat-fixes-session-fixation-and-madeyoureset-flaws/",
      "date": "2025-08-15T00:17:09Z",
      "description": "The post Patch Now: Apache Tomcat Fixes Session Fixation and ‘MadeYouReset’ Flaws appeared first on Daily CyberSecurity.",
      "source": "securityonline.info",
      "first_seen": "2025-08-15T03:45:25Z",
      "last_seen": "2025-08-15T03:45:25Z"
    },
    {
      "id": "fa346f1ab9044f87027f972cd64a8f940bb37e84",
      "title": "Qilin Ransomware Leads The Attack Landscape With 70+ Claimed Victims in July",
      "link": "https://cybersecuritynews.com/qilin-ransomware-leads-the-attack-landscape/",
      "date": "2025-08-14T23:51:31Z",
      "description": "The ransomware threat landscape witnessed a concerning surge in July 2025, with the Qilin ransomware group maintaining its dominant position for the third time in four months. The group successfully claimed 73 victims on its data leak site, representing 17.3% of the month’s total 423 ransomware incidents. This marks a significant consolidation of criminal operations […] The post Qilin Ransomware…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-15T03:45:25Z",
      "last_seen": "2025-08-15T05:44:22Z"
    },
    {
      "id": "bf16b2a9f82d7912254af7892fecde42d02c400f",
      "title": "Google Chrome Enterprise: Advanced Browser Security for the Modern Workforce",
      "link": "https://www.darkreading.com/endpoint-security/google-chrome-enterprise-advanced-browser-security-modern-workforce",
      "date": "2025-08-14T20:12:20Z",
      "description": "In this Dark Reading News Desk interview, Google's Mark Berschadski highlights the critical role browsers play in today's work environment and how Chrome Enterprise is evolving to meet modern security challenges while enabling productivity.",
      "source": "darkreading.com",
      "first_seen": "2025-08-15T03:45:25Z",
      "last_seen": "2025-08-15T06:57:14Z"
    }
  ]
}