{
  "date": "2025-08-14",
  "count": 7,
  "items": [
    {
      "id": "9639215452a65a4342a7d7c47d554630d5948441",
      "title": "CISA Adds Two N-able N-central Flaws to Known Exploited Vulnerabilities Catalog",
      "link": "https://thehackernews.com/2025/08/cisa-adds-two-n-able-n-central-flaws-to.html",
      "date": "2025-08-14T04:02:00Z",
      "description": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added two security flaws impacting N-able N-central to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation. N-able N-central is a Remote Monitoring and Management (RMM) platform designed for Managed Service Providers (MSPs), allowing customers to efficiently manage and secure",
      "source": "thehackernews.com",
      "first_seen": "2025-08-14T04:54:57Z",
      "last_seen": "2025-08-14T04:54:57Z"
    },
    {
      "id": "3074e466bf3d32bd001125110861307debc45e5f",
      "title": "Microsoft Exchange Server Vulnerabilities Let Attackers Spoof and Tamper Over Network",
      "link": "https://cybersecuritynews.com/microsoft-exchange-server-vulnerabilities/",
      "date": "2025-08-14T03:55:34Z",
      "description": "Critical security vulnerabilities in Microsoft Exchange Server enable attackers to perform spoofing and tampering attacks over network connections. The vulnerabilities include two Exchange Server flaws (CVE-2025-25007 and CVE-2025-25005) enabling spoofing and tampering attacks, plus a Windows Graphics Component elevation of privilege vulnerability (CVE-2025-49743) that could facilitate privilege…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T04:54:57Z",
      "last_seen": "2025-08-14T04:54:57Z"
    },
    {
      "id": "fde534c5fcd0ab81a5999b35aa0daeaed31e1db8",
      "title": "GitHub Copilot RCE Vulnerability via Prompt Injection Leads to Full System Compromise",
      "link": "https://cybersecuritynews.com/github-copilot-rce-vulnerability/",
      "date": "2025-08-14T02:18:54Z",
      "description": "A critical security vulnerability in GitHub Copilot and Visual Studio Code has been discovered that allows attackers to achieve remote code execution through prompt injection attacks, potentially leading to full system compromise of developers’ machines. The vulnerability, tracked as CVE-2025-53773, exploits GitHub Copilot’s ability to modify project configuration files, particularly the…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T04:54:57Z"
    },
    {
      "id": "3a5fe8a6b22f720d3210d468d9b6ea5b5c2d0637",
      "title": "Multiple GitLab Vulnerabilities Enables Account Takeover and Stored XSS Exploitation",
      "link": "https://cybersecuritynews.com/gitlab-vulnerabilities/",
      "date": "2025-08-14T01:46:50Z",
      "description": "GitLab has released emergency security patches addressing multiple critical vulnerabilities that could enable attackers to perform account takeovers and execute stored cross-site scripting (XSS) attacks. The patches were released on August 13, 2025, affecting GitLab Community Edition (CE) and Enterprise Edition (EE) across versions 18.2.2, 18.1.4, and 18.0.6. Key Takeaways1. GitLab patched three…",
      "source": "cybersecuritynews.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T04:54:57Z"
    },
    {
      "id": "17516d4d3876c6182f297bd1afcd250fdbf87f8e",
      "title": "Google Gemini's Deep Research is finally coming to API",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-geminis-deep-research-is-finally-coming-to-api/",
      "date": "2025-08-14T01:01:01Z",
      "description": "Google Gemini's one of the most powerful features is Deep Research, but up until now, it has been strictly limited to the Gemini interface. This could change soon. [...]",
      "source": "bleepingcomputer.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T04:54:57Z"
    },
    {
      "id": "a2bc56117626b86b80784e907e7d0ebce6e1a326",
      "title": "North Korea Attacks South Koreans With Ransomware",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/north-korea-attacks-south-koreans-ransomware",
      "date": "2025-08-14T00:00:00Z",
      "description": "DPRK hackers are throwing every kind of malware at the wall and seeing what sticks, deploying stealers, backdoors, and ransomware all at once.",
      "source": "darkreading.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T04:54:57Z"
    },
    {
      "id": "27c8d910576451927462c27bb502459cecba4e25",
      "title": "Norwegian Police Say Pro-Russian Hackers Were Likely Behind Suspected Sabotage at a Dam",
      "link": "https://www.securityweek.com/norwegian-police-say-pro-russian-hackers-were-likely-behind-suspected-sabotage-at-a-dam/",
      "date": "2025-08-13T20:05:00Z",
      "description": "During the April incident, hackers gained access to a digital system which remotely controls one of the dam’s valves and opened it to increase the water flow. The post Norwegian Police Say Pro-Russian Hackers Were Likely Behind Suspected Sabotage at a Dam appeared first on SecurityWeek.",
      "source": "securityweek.com",
      "first_seen": "2025-08-14T03:44:24Z",
      "last_seen": "2025-08-14T04:54:57Z"
    }
  ]
}